[
  {
    "name": "Thai",
    "country": "Thailand",
    "dishes": [
      "Ajad",
      "Basil Fried Rice",
      "Beef Drunken Noodles",
      "Beef Massaman Curry",
      "Beef Panang Curry",
      "Cendol",
      "Cha Manao",
      "Cha Yen",
      "Chicken Drunken Noodles",
      "Chicken Pad Thai",
      "Chicken Panang Curry",
      "Chicken With Basil",
      "Chifles",
      "Chili Basil Eggplant",
      "Crab Fried Rice",
      "Crispy Chicken",
      "Curry Puff",
      "Drunken Noodle",
      "Duck Rice",
      "Durian"
    ],
    "description": "Thai cuisine is the national cuisine of Thailand.\nThai cooking places emphasis on lightly prepared dishes with strong aromatic components and a spicy edge. It is known for its complex interplay of at least three and up to four or five fundamental taste senses in each dish or the overall meal: sour, sweet, salty, bitter and spicy. https://en.wikipedia.org/wiki/Thai_cuisine\nBpu, Pu = Crab\nGai = Chicken\nGoong, Kung = Shrimp\nHed = Mushrooms\nKa = Galangal\nKai, Khai = Egg\nKai dao, Khai dao = Fried egg\nKhao = Rice\nkhing = Ginger\nKrob = Crispy\nKor, Ko = Pig neck meat\nLarb, Laab, Lahb = Type of salad based on minced meat\nMoo, Muu, Mu = Pork\nNam = Sauce?\nNue, Nua, Neau = Beef\nPad = Stir-fried\nPed, phed, ເຜັດ (Lao) = Spicy\nPing = Grilled with skewer\nPla, Plah = Fish\nPla duk = Catfish\nPla-ra = Fermented fish\nPrik, Pik, Phrik = Chili, Pepper\nSab, saeb, ແຊບ (Lao) = delicious, yummy\nTom, Tome = Boil\nWan = Sweet\nYang = Grill, Roasted\nYum = Salad (Mix with hands)List of traditional fast food dishes that is sold at food stalls and cookshops in Thailand.Like many other Asian cuisines, Thai cooking uses rice as a basic ingredient for the majority of dishes. The word “food” in Thai language means literally “to eat rice”. Furthermore, it has 5 main tastes, which you may meet in almost every dish. These are: sour lime, savory fish sauce, hot chilli, salt and sweetness (usually added by …"
  },
  {
    "name": "Bangladeshi",
    "country": "Bangladesh",
    "dishes": [
      "Aam Papad",
      "Aloo Ki Tikki",
      "Baingan Bharta",
      "Baji",
      "Bakarkhani",
      "Bakorkhani",
      "Balushahi",
      "Bangladeshi Beef Shatkora",
      "Batasha",
      "Beef Birani",
      "Beef Kala Bhuna",
      "Beef Samosas",
      "Begun Bhaja",
      "Bhajiyas",
      "Bhapaa Aloo",
      "Bhapa Doi",
      "Bhapa Puli Pitha",
      "Bhindi Masala",
      "Bhuna",
      "Bhuna Khichuri"
    ],
    "description": "Bangladeshi cuisine (Bengali: বাংলাদেশের রান্না) is the national cuisine of Bangladesh. It is dominated by Bengali cuisine and has been shaped by the diverse history and riverine geography of Bangladesh. The country has a tropical monsoon climate.\nRice is the main staple of Bangladesh and is served with a wide range of curries. Sublime Bangladeshi dishes exhibit strong aromatic flavors; and often include eggs, potatoes, tomatoes and aubergines. A variety of spices and herbs, along with mustard oil and ghee, is used in Bangladeshi cooking. The main breads are naan, paratha, roti, bakarkhani and luchi. Dal is the second most important staple after rice. Fish is a staple in Bangladeshi cuisine, especially freshwater fish, which is a distinctive feature of the country's gastronomy. Major fish dishes include (ilish), pabda (butterfish), rui (rohu), pangash (pangas catfish), chitol (clown knifefish), magur (walking catfish), bhetki (barramundi) and tilapia. Meat consumption includes beef, lamb, venison, chicken, duck, squab and koel. Vegetable dishes, either mashed (bhurta), boiled (sabji), or leaf-based (saag), are widely served. Lobsters and shrimps are also often prevalent. https://en.wikipedia.org/wiki/Bangladeshi_cuisine\ngolla = ball\nKolar in Bengali means banana\nkancha = raw\nKolar in Bengali means banana\nmakha = kneaded\nBora = fried pakoraThe most traditional food of Bangladesh is rice, fish curry, lentils. Also, Bangladesh is famous for spicy dishes and also for its desserts.Here are 5 iconic Bengali breakfast dishes that you must try if you are a fan of flavors, spices and all things decadent."
  },
  {
    "name": "Tex-Mex",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Cuban",
    "country": "Cuba",
    "dishes": [
      "Arroz A La Cubana",
      "Arroz Con Huevo",
      "Arroz Con Pollo",
      "Arroz Imperial",
      "Bistec De Palomilla",
      "Bistec De Palomilla Con Arroz Chino",
      "Bistec De Pollo",
      "Cafecito",
      "Cafe Con Leche",
      "Camarones Al Ajillo",
      "Churrasco",
      "Churrasco Al Caballo",
      "Colada Coffee",
      "Congri",
      "Cortadito Coffee",
      "Croqueta",
      "Croqueta Preparada",
      "Cuba Libre",
      "Cuban Bread",
      "Cuban Sandwich"
    ],
    "description": "Cuban cuisine is a fusion of Native American Taino food, Spanish, African, and Caribbean cuisines. Some Cuban recipes share spices and techniques with Spanish and African cooking, with some Caribbean influence in spice and flavor. This results in a unique, interesting and flavorful blend of the several different cultural influences, with strong similarities with the cuisine of the neighboring Dominican Republic and Puerto Rico. A small but noteworthy Chinese influence can also be accounted for, mainly in the Havana area. During colonial times, Cuba was an important port for trade, and many Spaniards who lived there brought their culinary traditions along with them.\nAs a result of the colonization of Cuba by Spain, one of the main influences on the cuisine is from Spain. Along with Spain, other culinary influences include Africa, from the Africans that were brought to Cuba as slaves, and French, from the French colonists that came to Cuba from Haiti.Another important factor is that Cuba itself is an island, making seafood something that greatly influences Cuban cuisine. Another contributing factor to Cuban cuisine is the fact that Cuba is in a tropical climate. The tropical climate produces fruits and root vegetables that are used in Cuban dishes and meals\nWikiList of most common dishes consumed for breakfast in Cuba."
  },
  {
    "name": "German",
    "country": "Germany",
    "dishes": [
      "Aachener Printen",
      "Apple Strudel",
      "Bauernfruhstuck",
      "Baumkuchen",
      "Bavarian Pretzels",
      "Beck's Beer",
      "Berliner",
      "Bethmännchen",
      "Bienenstich",
      "Birnen Bohnen Und Speck",
      "Blachinda",
      "Blackberry Pie",
      "Black Forest Gateau",
      "Blueberry Pie",
      "Bratwurst",
      "Bremer Klaben",
      "Brenntar",
      "Broetchen",
      "Buckwheat Gateau",
      "Butterbrot"
    ],
    "description": "German cuisine has evolved as a national cuisine through centuries of social and political change with variations from region to region.\nThe southern regions of Germany, including Bavaria and neighbouring Swabia, share many dishes. Austrian cuisine is very similar. This originates in common religious and cultural history. Southern Germany and Austria are mainly Catholic, so religious fasting rules for Friday, Lent and Advent, even if no longer widely practiced, have influenced the cuisine.\nGermany has the second-highest number of Michelin starred restaurants, after France https://en.wikipedia.org/wiki/German_cuisineGermans are know for their traditional German cousine around the world. What many people don’t know is the fact that German cuisine is so much more than just sausage and meat. Depending on where in Germany you stay you will find a big variety of traditional and comfort foods. The area around Hamburg is know for fresh fish …common breakfast dishes that are eaten in GermanyComfort food from GermanyList of most common food you find in the street of Germany"
  },
  {
    "name": "Paraguayan",
    "country": "Paraguay",
    "dishes": [
      "Arró Quesú",
      "Chipa",
      "Chipa Guazu",
      "Chipa So'o",
      "Dulce De Batata",
      "Dulce De Guayaba",
      "Guiso Popó",
      "Kiveve",
      "Koleno",
      "Kosereva",
      "Lampreado",
      "Mate",
      "Mbeju",
      "Mbeyú",
      "Mosto",
      "Ovocne Knedliky",
      "Passion Fruit Mousse",
      "Pastafrola",
      "Pira Caldo",
      "Reviro"
    ],
    "description": "The cuisine of Paraguay is similar to the cuisines in Uruguay and the Falkland Islands. Meat, vegetables, manioc, maize, and fruits are common in Paraguayan cuisine. Barbecuing is both a cooking technique and often a social event, and are known as the Asado. Many dishes are based on corn, milk, cheese and meat, and fish caught in rivers are also eaten. There are about 70 varieties of chipa (cake) in Paraguay. Most chipas are made from manioc flour, which is derived from cassava, and cornmeal. https://en.wikipedia.org/wiki/Paraguayan_cuisineList of most traditional dishes from Paraguay you should try. Feel free to add dishes.People in Paraguay eat basically the same type of food that their North American neighbors eat, although more simply. Women do a lot more to prepare the meals than women in the United States to do. They also take great pride in their menus."
  },
  {
    "name": "Taiwanese",
    "country": "Taiwan",
    "dishes": [
      "Aiyu Jelly",
      "Avocado Or Papaya Milk",
      "Ban Tiao Noodles",
      "Bao Bing",
      "Ba Wan",
      "Beef Noodles Soup",
      "Black Pepper Cakes",
      "Braised Pork Rice",
      "Bubble Tea",
      "Cang Ying Tou",
      "Chicken Wing Rice Roll",
      "Cífàntuán",
      "Cucumber Salad",
      "Danzi Noodles",
      "Ding Bian Cuo",
      "Fish Ball Soup",
      "Flaky Scallion Pancakes",
      "Giant Pork Balls Soup",
      "Gua Bao",
      "Hakka Leicha"
    ],
    "description": "Taiwanese cuisine itself is often associated with influences from mid to southern provinces of China, most notably from the province of Fujian (Hokkien), but influences from all of mainland China can easily be found. A notable Japanese influence also exists due to the period when Taiwan was under Japanese rule. Traditional Chinese food can be found in Taiwan, alongside Fujian and Hakka-style as well as native Taiwanese dishes, including dishes from Guangdong, Jiangxi, Chaoshan, Shanghai, Hunan, Sichuan and Beijing.Delicious food you can find on the streets of Taiwan.Well known Taiwanese food you should tryTaiwanese cuisine is a wide assortment of its regional dishes, mostly defined by rice, seafoods, chicken, and pork. The cuisine of this East Asian country exhibits numerous similarities with ethnic Chinese and Japanese foods due to its close association with these countries."
  },
  {
    "name": "Nicaraguan",
    "country": "Nicaragua",
    "dishes": [
      "Coyol Wine",
      "Guirila",
      "Limonada Cimarrona",
      "Macuá",
      "Nacatamal",
      "Pio Quinto",
      "Rondón",
      "Salpicon",
      "Tajadas",
      "Vaho",
      "Vigoron"
    ],
    "description": "It includes a mixture of indigenous cuisine, Spanish cuisine and Creole cuisine. Despite the blending and incorporation of pre-Columbian and Spanish-influenced cuisine, traditional cuisine differs on the Pacific coast from the Caribbean coast. While the Pacific coast's main staple revolves around local fruits and corn, the Caribbean coast's cuisine makes use of seafood and coconut. As in many other Latin American countries, corn is a staple. It is used in many of the widely consumed dishes, such as nacatamal, and indio viejo. Corn is not only used in food; it is also an ingredient for drinks such as pinolillo and chicha as well as in sweets and desserts. Other staples are rice and beans. Rice is eaten when corn is not, and beans are consumed as a cheap protein by the majority of Nicaraguans. It is common for rice and beans to be eaten as a breakfast dish. There are many meals including these two staples; one popular dish, gallo pinto, is often served as lunch, sometimes with eggs. Nicaraguans do not limit their diet solely to corn, rice, and beans. Many Nicaraguans have small gardens of their own full of vegetables. From time to time, flowers are incorporated into their meals.\nCommonly used ingredients (including fruits and vegetables) are jocote, grosella, mimbro, mango, papaya, tamarind, pipian, apples, avocado, yuca, and quequisque. Herbs such as culantro, oregano and achiote are also part of the cuisine.\nhttps://en.wikipedia.org/wiki/Nicaraguan_cuisine"
  },
  {
    "name": "Trinidad And Tobago",
    "country": "Trinidad And Tobago",
    "dishes": [
      "Aloo Pie",
      "Bake And Shark",
      "Barbecued Pigtail",
      "Macaroni Pie",
      "Pelau",
      "Ponche Crema"
    ],
    "description": "Trinidad and Tobago’s enviable culinary landscape is a gastronomic narrative of flavours, encapsulating mouth-watering street food and fine dining cuisine. The unique cuisine of Trinidad and Tobago is a reflection of the country’s varied cultural influences, which includes Asian, African, Oriental, Creole and European delicacies - a journey around the world for your palate.List of traditional fast food dishes that is sold at food stalls and cookshops all over Trinidad and Tobago"
  },
  {
    "name": "Greek",
    "country": "Greece",
    "dishes": [
      "Afelia",
      "Akanes",
      "Avgolemono",
      "Avgolemono Chicken Soup",
      "Baklava",
      "Birds Nest Baklava",
      "Bougatsa",
      "Briam",
      "Burma Circles Baklava",
      "Cretan Ntakos",
      "Dakos",
      "Dolmade",
      "Fasolada",
      "Fasolakia",
      "Feta Bouyiourdi",
      "Feta Cheese",
      "Flaouna",
      "Florina Pepper",
      "Froutalia",
      "Galaktoboureko"
    ],
    "description": "Greek cuisine is very diverse and although there are many common characteristics among the culinary traditions of different regions within the country, there are also many differences. Greece has an ancient culinary tradition dating back several millennia, and over the centuries Greek cuisine has evolved and absorbed numerous influences and influenced many cuisines itself. Some dishes can be traced back to ancient Greece, some to the Hellenistic and Roman periods, and Byzantium. Many dishes are part of the larger tradition of Ottoman cuisine and their names reveal Arabic, Persian or Turkish roots.\nThe most characteristic and ancient element of Greek cuisine is olive oil, which is used in most dishes. Greek cuisine uses some flavorings more often than other Mediterranean cuisines do, namely: oregano, mint, garlic, onion, dill and bay laurel leaves. Other common herbs and spices include basil, thyme and fennel seed. Parsley is also used as a garnish on some dishes.\nhttps://en.wikipedia.org/wiki/Greek_cuisineVegetarian Dishes you find in GreeceThere are many things, in general, you can try, from salads to hot dishes, from sweets to soups. But if you want something traditional, cheap and fast – it`s definitely souvlaki. The iconic dish of Greece is a fast food that you usually can find anywhere on the streets, in the bars, in small take-out shops and cafes. …"
  },
  {
    "name": "Scandinavian",
    "country": "Norway",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Southwestern",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Moroccan",
    "country": "Morocco",
    "dishes": [
      "Baghrir",
      "Beef Tagine",
      "Bissara",
      "Boulfaf",
      "Briouat",
      "Bstilla",
      "Chicken Tagine",
      "Couscous",
      "Djej Emshmel",
      "El Hergma",
      "Ghoriba",
      "Harcha",
      "Harira",
      "Harissa",
      "Herbel",
      "Kabab Maghdour",
      "Kefta Briouat",
      "Kefta Tagine",
      "Kouah",
      "Krachel"
    ],
    "description": "Moroccan cuisine is typically a mix of Mediterranean, Arabic, Andalusian and Berber cuisine. The cooks in the royal kitchens of Fes, Meknes, Marrakech, Rabat and Tetouan created the basis for what is known as Moroccan cuisine today.Eid Al Adha is a very holy festival throughout the Muslim country. On this day animals like cow, goat, sheep, camel, and other halal animals are slaughtered. Different dishes are made at home with fresh meat. Again many desserts are also made."
  },
  {
    "name": "Creole",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Albanian",
    "country": "Albania",
    "dishes": [
      "Ballokume",
      "Boza",
      "Byrek",
      "Chickpea Bread",
      "Fërgesë",
      "Flia",
      "Gjize",
      "Jani Me Fasule",
      "Kabuni",
      "Kashkaval",
      "Qumështor",
      "Shapkat",
      "Speca Me Gjize",
      "Speca Të Mbushur",
      "Tavë Kosi",
      "Tulumba"
    ],
    "description": "It is a representative of the cuisine of the Mediterranean. It is an example of the Mediterranean diet due to the importance of olive oil, fruits, vegetables and fish. The cooking traditions of the Albanian people are diverse due to the environmental factors such as the geological and climatic conditions, which are suitable for the cultivation of nearly all kinds of herbs, vegetables and fruits. Nevertheless, olive oil is the most ancient and commonly used vegetable fat in Albanian cooking, which has been produced since antiquity throughout the country particularly along the coasts.These foods are the most popular in Albania. You should try this food."
  },
  {
    "name": "British",
    "country": "United Kingdom of Great Britain and Northern Ireland",
    "dishes": [
      "Angel Delight",
      "Apple Crisp",
      "Bacon Butty",
      "Banbury Cake",
      "Bannocks",
      "Banoffee Pie",
      "Barm Cake",
      "Bath Oliver",
      "Battenberg Cake",
      "Battered Sausage",
      "Bread And Butter Pudding",
      "Bubble And Squeak Cakes",
      "Butter Pie",
      "Caraway Seed Cake",
      "Charcoal Biscuit",
      "Chelsea Bun",
      "Chess Pie",
      "Chocolate Pudding",
      "Coffee Jelly",
      "Cornish Fairing"
    ],
    "description": "British cuisine is the specific set of cooking traditions and practices associated with the United Kingdom. British cuisine has been described as \"unfussy dishes made with quality local ingredients, matched with simple sauces to accentuate flavour, rather than disguise it.\" However, British cuisine has absorbed the cultural influence of those who have settled in Britain, producing many hybrid dishes, such as the Anglo-Indian chicken tikka masala.\nFish and chips, a popular take-away food of the United Kingdom Celtic agriculture and animal breeding produced a wide variety of foodstuffs for indigenous Celts and Britons. Anglo-Saxon England developed meat and savory herb stewing techniques before the practice became common in Europe. The Norman conquest introduced exotic spices into England in the Middle Ages. The British Empire facilitated a knowledge of India's elaborate food tradition of \"strong, penetrating spices and herbs\". Food rationing policies, put in place by the British government during wartime periods of the 20th century, are said to have been the stimulus for British cuisine's poor international reputation. It has been claimed, contrary to popular belief, that people in southern England eat more garlic per head than the people of northern France.\nBritish cuisine has traditionally been limited in its international recognition to the full breakfast, fish and chips, and the Christmas dinner. Other British dishes include the Sunday roast, steak and kidney pie, shepherd's pie, and bangers and mash. British cuisine has many regional varieties within the broader categories of English, Scottish and Welsh cuisine. Each has developed its own regional or local dishes, many of which are geographically indicated foods such as Cornish pasties, the Yorkshire pudding, Cumberland Sausage, Arbroath Smokie, and Welsh cakes."
  },
  {
    "name": "Australian",
    "country": "Australia",
    "dishes": [
      "Anzac Biscuit",
      "Avocado Toast",
      "Bush Bread",
      "Cheesymite Scroll",
      "Chiko Roll",
      "Chocolate Crackles",
      "Damper",
      "Fairy Bread",
      "Fresh Zucchini Salad With Spicy Chicken Grilled",
      "Lamb Leg Roast",
      "Lamingtons",
      "Meat Pie",
      "Neenish Tart",
      "Pea And Ham Soup",
      "Salt And Pepper Calamari",
      "Sao Biscuit",
      "Sausage Roll",
      "Sausage Sizzle",
      "Syrah Wine",
      "Tiger Toast"
    ],
    "description": "Australian cuisine refers to the cuisine of Australia and its indigenous and colonial societies. Indigenous Australians have occupied Australia for some 40,000 to 60,000 years, during which they developed a unique hunter-gatherer diet, known as \"bush tucker\", drawn from regional Australian flora and fauna—such as the kangaroo. Australia was, from 1788 to 1900, a collection of British colonies in which culinary tastes were strongly influenced by British and Irish migrants - and agricultural products such as beef cattle, sheep and wheat became staples in the Australian diet. Post-war Australia's multicultural immigration program lead to a diversification of the cuisine of Australia, particularly under the influence of Mediterranean and East Asian Australians.\nhttps://en.wikipedia.org/wiki/Australian_cuisineAUSTRALIANS LAY CLAIM to wonderful food creations, some more ingenious than others, yet our attachment to our Aussie food 'classics' suggests that it is the simpler things that take our fancy. Whether at a family Christmas feast at the height of a scorching Australian summer or barracking at a local footy match in the depths of winter, Australians …"
  },
  {
    "name": "Iranian",
    "country": "Iran",
    "dishes": [
      "Abgoosht",
      "Abnabat",
      "Affogato",
      "Albaloo Polo",
      "Ash",
      "Ash-E Doogh",
      "Ashe Sabzi",
      "Ash Reshteh",
      "Baghala Ghatogh",
      "Baghali Polo",
      "Bamiyeh",
      "Baqala Polow",
      "Barbari Bread",
      "Bastani Sonnati",
      "Chelow Kabab",
      "Chicken Rogan Josh",
      "Doogh",
      "Duck Fesenjan",
      "Faloodeh",
      "Faludeh"
    ],
    "description": "Iranian food (also referred to as Persian food) is some of the most delicious and fresh in its region. It is also quite healthy, using only small amounts of red meat (usually lamb or beef), emphasizing larger amounts of grains (especially rice), fruits, and vegetables. Although it is often lumped under the category of general \"Middle Eastern\" fare, the Iranian cuisine is able to retain its uniqueness in a variety of ways. One of these ways is preparing meals with contrasting flavors, such as a\nRead more: http://www.foodbycountry.com/Germany-to-Japan/Iran.html#ixzz40r0…The state of Madhya Pradesh is rich in culture and history. But that’s not all. The heart of India also has many mouthwatering delicacies to offer. Whether you’re a vegetarian or a meat eater, Madhya Pradesh has deliciously delightful food for all. Here is a list of some amazing dishes that you shouldn’t miss out on when visiting …Bengali cuisine has a rich history that goes back thousand of years, somewhere along the way Mughal and British influences also played their part in shaping the Bengali cuisine we understand today.Who doesn’t love Arabic food? With dishes from the Middle East, such as hummus, found in groceries stores around the world, as well as kebabs and shawarmas, being beloved dishes globally – it’s about time someone talked about Arabic desserts. These are very different from traditional cakes and chocolates, however, they are just as delicious."
  },
  {
    "name": "Welsh",
    "country": "United Kingdom of Great Britain and Northern Ireland",
    "dishes": [
      "Bara Brith",
      "Cawl",
      "Clark's Pies",
      "Conwy Mussels",
      "Crempog",
      "Glamorgan Sausage",
      "Laverbread",
      "Leek Soup",
      "Lobscawsa",
      "Roasted Salt Marsh Lamb Leg",
      "Roast Lamb With Laver Sauce",
      "Sewin And Samphire",
      "Tatws Popty",
      "Tatws Pum Munud",
      "Teisennau Tatws",
      "Welsh Cake",
      "Welsh Cheese",
      "Welsh Rabbit",
      "Welsh Rarebit"
    ],
    "description": "Welsh cuisine encompasses the cooking traditions and practices of the country of Wales and the Welsh people. Whilst there are a large number of dishes that can be considered Welsh due to their ingredients and/or history, dishes such as cawl, Welsh rarebit, laverbread, Welsh cakes, bara brith and the Glamorgan sausage have all been regarded as symbols of Welsh food. There is some variation in dishes around Wales, but the most pronounced difference is in the Gower Peninsula, an isolated rural area which was heavily influenced by Somerset and Devon. There the dishes created included whitepot and often incorporated pumpkin.\nWhile Wales has imported throughout the centuries some culinary practices and dishes from its British neighbors, uniquely Welsh cuisine grew largely from the lives of the Welsh working folk, such as farmers, shepherds, and peasants, as these Welsh working people tended to be more isolated from outside culinary influences. Welsh common folk were instead influenced by the food that they could produce based on what little ingredients they could produce or afford, all while having little or no contact with neighboring English cuisine and English society. Welsh Celts and their more recent Welsh descendants originally practiced transhumance, moving their cattle to higher elevations in the summer and back to their home base in the winter. Once they settled to homesteads, a family would have generally eaten meat from a pig primarily, keeping a cow for dairy products. Vegetables beyond cabbages and leeks were rare.\nIn Wales, beef and dairy cattle are raised widely. Sheep farming, however, is extensive in the country, and lamb is the meat traditionally associated with Wales. Other important produce includes seafood—especially close to the coast, where fishing culture is strong and fisheries are common. This is exemplified by the use of cockles and laverbread in Welsh cuisine. The leek, the country's national vegetable, is also used frequently in Welsh cuisine. Since the 1970s, the rise of the gastropub and high-end restaurants has given Wales five Michelin-starred restaurants.\nhttps://en.wikipedia.org/wiki/Welsh_cuisineFor years, Wales has offered visitors wondrous sights unlike anywhere else in the UK. Tourists will experience anything from the retina-stretching mountainous ranges of Snowdonia and the otherworldly uniqueness of Portmeirion, to the wild and gloriously windswept Pembrokeshire Coast and the fabulously expansive golden beaches of the Gower Peninsula. The great food traditions of Wales stretch back centuries …Welsh recipes stem from a history of stoic people who lived off the land and what was available at the time. The food was designed to fuel the hard working locals with simple dishes with good quality ingredients."
  },
  {
    "name": "Israeli",
    "country": "Israel",
    "dishes": [
      "Carrot Tzimmes",
      "Chakchouka",
      "Chicken Salad With Dried Fruit Chutney",
      "Green Beans With Cherry Tomatoes",
      "Honey Fig Cake",
      "Kashe Varnishkes",
      "Knaidlach",
      "Lamb Couscous",
      "Matzah Brei",
      "Meorav Yerushalmi",
      "Ptitim",
      "Quince Cheese",
      "Rugelach",
      "Rye Bread",
      "Sabich",
      "Sufganiyah",
      "Zhoug"
    ],
    "description": "The dish of Israeli cuisine comprises local dishes by people native to Israel and dishes brought to Israel by Jews from the Diaspora. Israeli cuisine has adopted, and continues to adapt, elements of various styles of Jewish cuisine, particularly the Mizrahi, Sephardic and Ashkenazi styles of cooking. It incorporates many foods traditionally eaten in Levantine, Middle Eastern and Mediterranean cuisines, and foods such as falafel, hummus, msabbha, shakshouka, couscous, and za'atar are now widely popular in Israel."
  },
  {
    "name": "Mongolian",
    "country": "Mongolia",
    "dishes": [
      "Bantan",
      "Borts",
      "Budaatai Kuurga",
      "Buuz",
      "Chanasan Mahk",
      "Guriltai Shul",
      "Kashk",
      "Khorkhog",
      "Khuushur",
      "Khuushuur",
      "Kumis",
      "Mongolian Mary",
      "Mutton Kebabs",
      "Tsuvian",
      "Ul Boov"
    ],
    "description": "Mongolian cuisine refers to the local culinary traditions of Mongolia and Mongolian styled dishes. The extreme continental climate has affected the traditional diet, so the Mongolian cuisine primarily consists of dairy products, meat, and animal fats.\nThe most common rural dish is cooked mutton, often without any other ingredients. In the city, every other local displays a sign saying \"buuz\". Those are steamed dumplings filled with meat. Other types of dumplings are boiled in water (bansh, manti), or deep fried in mutton fat (khuushuur). Other dishes combine the meat with rice or fresh noodles made into various stews (tsuivan, budaatai huurga) or noodle soups (guriltai shol).\nThe most surprising cooking method is only used on special occasions. In this case, the meat (often together with vegetables) gets cooked with the help of stones, which have been preheated in a fire. This either happens with chunks of mutton in a sealed milk can (khorkhog), or within the abdominal cavity of a deboned goat or marmot (boodog).\nhttps://en.wikipedia.org/wiki/Mongolian_cuisineTraditional Mongolian cuisine is very rich and satisfying, using the meats and dairy products that are native to the lifestyle of the area. It takes influences from the cuisines of many neighboring countries, but with many factors that are uniquely Mongolian. Mongolian dishes are also traditionally very warm and hearty to fit with the cold climate of the …"
  },
  {
    "name": "Amish",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Canadian",
    "country": "Canada",
    "dishes": [
      "Ace Hill Pilsner Beer",
      "Bannocks",
      "Beef Tongue",
      "Blueberry Pie",
      "Bumbleberry Pie",
      "Butter Tart",
      "Caesar",
      "Canadian Bacon",
      "Corned Beef",
      "Date Square",
      "French Fries",
      "Herb And Lemon Roasted Chicken",
      "Jelly",
      "Jiggs Dinner",
      "Kokanee Beer",
      "Kraft Dinner",
      "Labatt Blue Beer",
      "Maple Leaf Cream Cookies",
      "Maple Syrup",
      "Mcmuffin"
    ],
    "description": "Cuisine from Canada varies widely depending on the regions of the nation. The three earliest cuisines of Canada have First Nations, English, Scottish and French roots, with the traditional cuisine of English Canada closely related to British cuisine, while the traditional cuisine of French Canada has evolved from French cuisine and the winter provisions of fur traders. With subsequent waves of immigration in the 19th and 20th century from Central, Southern, and Eastern Europe, South Asia, East Asia, and the Caribbean, the regional cuisines were subsequently augmented.Canada's culinary contributions range from centuries-old savory soups to rich desserts with mysterious histories. Here are 10 truly Canadian foods and the best places to try them."
  },
  {
    "name": "American",
    "country": "United States of America",
    "dishes": [
      "35th Anniversary Expedition Stout Reserve Beer",
      "60 Minute IPA Beer",
      "Abita Select Amber Ale",
      "Ahi Tuna Poke Bowls",
      "Akutaq",
      "Alexander Cocktail",
      "Algonquin Cocktail",
      "A Little Sumpin' Sumpin' Ale Beer",
      "All Day IPA Beer",
      "Almond Bark",
      "Amaretto Colada",
      "Ambrosia",
      "American Chop Suey",
      "American Goulash",
      "American Lasagna",
      "Americano",
      "Anadama Bread",
      "Angel City Ipa Beer",
      "Angel Food Cake",
      "Apple"
    ],
    "description": "The cuisine of the United States reflects its history. The European colonization of the Americas yielded the introduction of a number of ingredients and cooking styles to the latter. The various styles continued expanding well into the 19th and 20th centuries, proportional to the influx of immigrants from many foreign nations; such influx developed a rich diversity in food preparation throughout the country.\nEarly Native Americans utilized a number of cooking methods in early american cuisine that have been blended with early European cooking methods to form the basis of american cuisine. When the colonists came to Virginia, Massachusetts, or any of the other English colonies on the eastern seaboard of north america, they farmed animals for clothing and meat in a similar fashion to what they had done in Europe. They had cuisine similar to their previous British cuisine. the american colonial diet varied depending on the settled region in which someone lived. Commonly hunted game included deer, bear, buffalo and wild turkey. A number of fats and oils made from animals served to cook much of the colonial foods. Prior to the revolution, New Englanders consumed large quantities of rum and beer, as maritime trade provided them relatively easy access to the goods needed to produce these items: rum was the distilled spirit of choice, as the main ingredient, molasses, was readily available from trade with the west indies. In comparison to the northern colonies, the southern colonies were quite diverse in their agricultural diet and did not have a central region of culture.\nhttp://en.wikipedia.org/wiki/cuisine_of_the_united_statesBeer is a favorite alcoholic beverage of Americans. The alcohol content of beers can vary widely, from a light weak beer with a low alcohol percentage to beers with a high alcohol percentage. Most places that sell beer and other alcohol often don't give you the alcohol percentage so this list can help you figure out what you …This is a list of the most common hard seltzers sold in the US organized by calories from lowest to highest.Most common dishes consumed for breakfast in the United States of America.Common dishes you find in a restaurant diner in the US7% ABV and up"
  },
  {
    "name": "Singaporean",
    "country": "Singapore",
    "dishes": [
      "Acar Awak",
      "Apam Balik",
      "Bak Chor Mee",
      "Bandung",
      "Bubur Cha Cha",
      "Cendol",
      "Char Kway Teow",
      "Chili Crab",
      "Chilli Crab",
      "Chwee Kueh",
      "Curry Mee",
      "Curry Puff",
      "Duck Rice",
      "Fried Carrot Cake",
      "Hainanese Chicken Rice",
      "Hokkien Char Mee",
      "Hokkien Prawn Mee",
      "Ice Cream Sandwich",
      "Ketupat",
      "Kueh Bangkit"
    ],
    "description": "Singaporean cuisine is indicative of the ethnic diversity of the culture of Singapore which originated from Malaysia, as a product of centuries of cultural interaction owing to Singapore's strategic location. The food is influenced by the native Malay, the predominant Chinese, Indonesian, Indian, Peranakan, and Western traditions (particularly English and some Portuguese-influenced Eurasian, known as Kristang)since the founding of Singapore by the British in the nineteenth century. Influences from other areas such as Sri Lanka, Thailand, and the Middle East exist in local food culture as well. In Singaporean hawker stalls, for example, chefs of Chinese background influenced by Indian culture might experiment with condiments and ingredients such as tamarind, turmeric, and ghee, while an Indian chef might serve a fried noodle dish. With a variety of influences from different countries, it is suffice to note that the globalization phenomenon affects the cuisine in Singapore as well.Dishes you find in Singapore for breakfastFood, dishes and snacks you find on the street in Singapore."
  },
  {
    "name": "Ukrainian",
    "country": "Ukraine",
    "dishes": [
      "Aspic",
      "Bigos",
      "Borscht",
      "Chicken Kiev",
      "Deruny",
      "Holubtsi",
      "Kielbasa",
      "Korovai",
      "Kutia",
      "Kyiv Cake",
      "Nalesniki",
      "Oladi",
      "Pască",
      "Potato Zrazy",
      "Ryazhenka",
      "Salo",
      "Uzvar",
      "Varenyky",
      "Walnut Stuffed Prunes",
      "Zhele"
    ],
    "description": "Cuisine of the people of Ukraine has had a number of influences including Russian, Polish, German and Turkish. Popular ingredients in the cuisine of Ukraine are meat, mushrooms, vegetables, berries, fruit and herbs. As Ukrainians are extremely hospitable their meals are served in very generous quantities.\nSome of the best Ukrainian cuisine is actually very simple. Many ingredients are used in what some mayit fo consider unusual combinations, creating a unique and sumptuous dish. Considered the “breadbasket of Europe”, it follows that bread is a staple in Ukraine. There are dozens of methods used in preparing breads, which are often used in rituals and customs. Dishes often contain pickled vegetables when these are not in season and certain dishes can only be made when ingredients are available. Pastries and cakes are popular, but not very sweet."
  },
  {
    "name": "Spanish",
    "country": "Spain",
    "dishes": [
      "Aioli",
      "Ajoarriero",
      "Ajoblanco",
      "Angulas",
      "Arbequina",
      "Arroz Con Pollo",
      "Bacalao Al Pil-Pil",
      "Barquillo",
      "Bocadillo De Tortilla",
      "Bocadillos",
      "Boquerones En Vinagre",
      "Botifarra",
      "Broa",
      "Cachopo",
      "Caldereta",
      "Callos A La Madrilena",
      "Caparrones",
      "Catanies",
      "Cecina",
      "Cezerye"
    ],
    "description": "Spanish cuisine is a way of preparing varied dishes, which is enriched by the culinary contributions of the various regions that make up the country. It is a cuisine influenced by the people who, throughout history, have conquered the territory of that country, as well by the subsequently colonized regions.Vegetarian dishes you will find in SpainThis traditional Spanish dishes are rich and delicious and will keep you satisfied for sure!Spain is famous for many things – flamenco, football, and the long, lazy sunny days, to name just a few. It’s the birthplace of Picasso and siesta, and prides itself with gorgeous beaches, stylish islands, and some of the most striking architecture to be found anywhere in Europe. Its warm, friendly locals have incredibly long names, and their …"
  },
  {
    "name": "Irish",
    "country": "Ireland",
    "dishes": [
      "Bacon And Cabbage",
      "Baileys Irish Cream Liqueur",
      "Baked Beans",
      "Bangers And Mash",
      "Barmbrack",
      "Battered Sausage",
      "Blaa",
      "Black Pudding",
      "Boxty",
      "Breakfast Roll",
      "Brioche Bread And Butter Pudding",
      "Brown Bread",
      "Champ",
      "Chocolate Pudding",
      "Coddle",
      "Colcannon",
      "Corned Beef Hash Cakes",
      "Corned Beef Sandwich",
      "Cottage Pie",
      "Crubeens"
    ],
    "description": "Irish cuisine is a style of cooking originating from Ireland or developed by Irish people. It evolved from centuries of social and political change and mixing between the different cultures on the island, predominantly English and Irish.\nThe cuisine takes its influence from the crops grown and animals farmed in its temperate climate. However, the development of Irish cuisine was distorted by the English conquest in the early 17th century because this forced the impoverishment of the mass of the people through land dispossession and the organisation of Irelands economy to provide supplies to England and its armed forces. This also replaced the upper levels of cuisine with English norms. Consequently, the potato, after its widespread adoption in the 18th century became almost the only food of the poor (the vast majority of the population) and, as a result, is often now closely associated with Ireland. Many elements of Irish cuisine were lost during this time and particularly from the Famine up until the late 20th century, but are now being revived. Representative modern Irish dishes include Irish stew, bacon and cabbage, boxty, coddle, and colcannon.\nhttps://en.wikipedia.org/wiki/Irish_cuisineThese are the delicious Irish breakfasts you must try."
  },
  {
    "name": "Vietnamese",
    "country": "Vietnam",
    "dishes": [
      "Bánh Bột Lọc",
      "Bánh Cam",
      "Bánh Canh",
      "Bánh Chưng",
      "Bánh Cuốn",
      "Bánh Dầy Đậu",
      "Bánh Mì",
      "Bánh Mì Xá Xíu",
      "Bánh Tằm Cà Ri",
      "Banh Tieu",
      "Bánh Xèo",
      "Bo Luc Lac",
      "Bo Nuong",
      "Bun Bo Hue",
      "Bún Bò Xào",
      "Bun Cari Ga",
      "Bun Cha",
      "Ca Kho To",
      "Canh Chua",
      "Cao Lầu"
    ],
    "description": "Vietnamese cuisine encompasses the foods and beverages of Vietnam, and features a combination of five fundamental tastes (Vietnamese: ngu v?) in the overall meal. Each Vietnamese dish has a distinctive flavor which reflects one or more of these elements. Common ingredients include fish sauce, shrimp paste, soy sauce, rice, fresh herbs, and fruits and vegetables. Vietnamese recipes use lemongrass, ginger, mint, Vietnamese mint, long coriander, Saigon cinnamon, bird's eye chili, lime, and basil leaves.\nTraditional Vietnamese cooking is greatly admired for its fresh ingredients, minimal use of oil, and reliance on herbs and vegetables. With the balance between fresh herbs and meats and a selective use of spices to reach a fine taste, Vietnamese food is considered one of the healthiest cuisines worldwide. http://en.wikipedia.org/wiki/Vietnamese_cuisine\nCanh = Soup\nCơm = cooked rice\nCuốn = Roll\nGỏi = Salad\nNuong = Grilled\nTom = Shrimp\ntrứng hấp = Steamed eggWhen you are out of the country, you need some hints not to get lost in the variety of tastes and flavors. If you are in Vietnam you should try this dishes. The main ingredients of Vietnamese food include shrimp paste, fish sauce, rice, herbs, Thai basil, fruits and vegetables. But at the same time, unlike other Asian …"
  },
  {
    "name": "New American",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Armenian",
    "country": "Armenia",
    "dishes": [
      "Arganak",
      "Arroz Con Pollo",
      "Bozbash",
      "Byorek",
      "Ghapama",
      "Harissa",
      "Keshk",
      "Khash",
      "Khorovats",
      "Kufteh",
      "Lahmajoon",
      "Loco Moco",
      "Matnakash",
      "Matsoni",
      "Muglai Barata",
      "Pilaf",
      "Qutab",
      "Sorbet"
    ],
    "description": "The cuisine from Armenia belongs to the family of Caucasian cuisines, and has strong ties with Turkish cuisine, Georgian cuisine, Persian cuisine, and Levantine cuisine.\nArmenian cuisine is similar to those of neighboring countries with many features but it differs from them a lot, too. For example, Armenians value the natural taste of food.\n- The flavor of the food relies on the quality and freshness of the ingredients rather than on excessive use of spices.\n- Fresh herbs are used extensively, both in the food and as accompaniments. Dried herbs are used in the winter, when fresh herbs are not available.\n- Wheat is the primary grain and is found in a variety of forms, such as: whole wheat, shelled wheat, bulgur (parboiled cracked wheat), semolina, farina, and flour. Historically, rice was used mostly in the cities (especially in areas with a large Turkish population) and in certain rice-growing areas (e.g., Marash and the region around Yerevan).\n- Legumes are used liberally, especially chick peas, lentils, white beans, and kidney beans.\nNuts are used both for texture and to add nutrition to Lenten dishes. Of primary usage are walnuts, almonds, pine nuts, but also hazelnuts, pistachios (in Cilicia), and nuts from regional trees.\n- Fresh and dried fruit are used both as main ingredients and as sour agents. As main ingredients, the following fruit are used: apricots (fresh and dried), quince, melons, and others. As sour agents, the following fruits are used: sumac berries (in dried, powdered form), sour grapes, plums (either sour or dried), pomegranate, apricots, cherries (especially sour cherries), and lemons.\n- In addition to grape leaves, cabbage leaves, chard, beet leaves, radish leaves, strawberry leaves, and others are also stuffed."
  },
  {
    "name": "Colombian",
    "country": "Colombia",
    "dishes": [
      "Aborrajado",
      "Aguardiente",
      "Ajiaco",
      "Ajiaco Colombiano",
      "Almojabana",
      "Arepa",
      "Arepas De Queso",
      "Arroz Atollado",
      "Arroz Con Coco",
      "Arroz Con Huevo",
      "Arroz De Lisa",
      "Bandeja Montanero",
      "Bandeja Paisa",
      "Bistec A Caballo",
      "Buñuelo",
      "Calentado",
      "Canelazo Cocktail",
      "Champús",
      "Chancaca",
      "Changua"
    ],
    "description": "Colombian cuisine includes the cooking traditions and practices of Colombia's Caribbean shoreline, Pacific coast, mountains, jungle, and ranchlands. Colombian cuisine varies regionally and is influenced by the Indigenous Chibcha, Spanish, African, Arab and some Asian influences. Colombian coffee is renowned for its high quality. (Wiki)One of the great joys of traveling is being able to try the traditional food of a country. Travel Supermarket takes a closer look at 10 traditional dishes to try when visiting Colombia:Colombian food is very diverse, each region of the country having its own characteristic dishes. This wonderful cuisine offers dishes that have been handed down from generation to generation, influenced by not only indigenous Colombian culture, but Spanish, African and Arab cultures as well. Colombian food is versatile, rich, full of flavor, colorful and comforting."
  },
  {
    "name": "Moldovan",
    "country": "Moldova",
    "dishes": [
      "Bors",
      "Borș De Burechiușe",
      "Ciulama",
      "Mămăligă",
      "Mucenici",
      "Murături",
      "Plăcintă",
      "Răcituri",
      "Saramură",
      "Sfințișori",
      "Tochitură"
    ],
    "description": "It is a style of cooking related to the people of Moldova and its breakaway region of Transnistria. It consists mainly of traditional European foods, such as beef, pork, potatoes, cabbage, and a variety of cereal grains. Moldovan dish is a well-known Romanian dish, mămăligă (a cornmeal mush or porridge). This is a staple polenta-like food on the Moldovan table, served as an accompaniment to stews and meat dishes or garnished with cottage cheese, sour cream, or pork rind. Regional delicacies include brânză (a brined cheese) and ghiveci (a lamb or goat stew). Local wines accompany most meals.\nTraditional for the Moldovan cuisine are dishes combining diverse vegetables, such as tomatoes, bell peppers, aubergine, cabbage, beans, onions, garlic, and leek. Vegetables are used in salads and sauces, and they are baked, steamed, pickled (called murături), salted, or marinated."
  },
  {
    "name": "New Mexican",
    "country": "United States of Ammerica",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Syrian",
    "country": "Syria",
    "dishes": [
      "Luqaimat",
      "Maqluba",
      "Shakriya",
      "Syrian Pita Bread",
      "Yalanji"
    ],
    "description": "Syrian cuisine may refer to the cooking traditions and practices in modern-day Syria (as opposed to Greater Syria), merging the habits of people who settled in Syria throughout its history.\nSyrian cuisine mainly uses eggplant, zucchini, garlic, meat (mostly from lamb and sheep), sesame seeds, rice, chickpeas, fava beans, lentils, cabbage, cauliflower, vine leaves, pickled turnips, cucumbers, tomatoes, olive oil, lemon juice, mint, pistachios, honey and fruits.\nAt the beginning of the 21st century, selections of appetizers known as \"meze\" are customarily served along with Arabic bread before the Syrian meal's main course, which is followed by coffee, with sweet confectioneries or fruits at will. Many recipes date from at least the 13th century (Wikipedia)"
  },
  {
    "name": "Pakistani",
    "country": "Pakistan",
    "dishes": [
      "Aloo Gosht",
      "Aloo Keema",
      "Baingan Bharta",
      "Balushahi",
      "Biryani",
      "Boroi Achar",
      "Chaat",
      "Chapli Kebab",
      "Chargha",
      "Chicken Bhuna",
      "Chicken Jalfrezi",
      "Chicken Jhaal Fry",
      "Chicken Karahi",
      "Chicken Korma",
      "Chicken Malai Boti",
      "Creamy Mung Dal",
      "Dhaniya Chutney",
      "Egg Bhuna",
      "Egg Bhurji",
      "Gulkand"
    ],
    "description": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the sixth-most populous country with a population exceeding 199 million people. It is the 36th largest country in the world in terms of area with an area covering 881,913 km2 (340,509 sq mi). Pakistan has a 1,046-kilometre (650 mi) coastline along the Arabian Sea and the Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest and China in the far northeast respectively. It is separated from Tajikistan by Afghanistan's narrow Wakhan Corridor in the north, and also shares a maritime border with Oman.\nThe territory that now constitutes Pakistan was previously home to several ancient cultures, including the Mehrgarh of the Neolithic and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Indian Mauryan Empire, the Persian Achaemenid Empire, Alexander of Macedonia, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Durrani Empire, the Sikh Empire and the British Empire.\nPakistan is unique among Muslim countries as it is the only country to have been created in the name of Islam. As a result of the Pakistan Movement led by Muhammad Ali Jinnah and the subcontinent's struggle for independence, Pakistan was created in 1947 as an independent nation for Muslims from the regions in the east and west of the Subcontinent where there was a Muslim majority. Initially a dominion, Pakistan adopted a new constitution in 1956, becoming an Islamic republic. A civil war in 1971 resulted in the secession of East Pakistan as the new country of Bangladesh.\nhttps://en.wikipedia.org/wiki/PakistanJust like the city itself the cuisine of Karachi is a mixture of numerous different influences. Many ethnic groups and traditions have contributed their flavors, spices, and methods to create a unique collection of tantalizing foods that are on the spicier side with a focus on fragrance and meat. Here is a list of the top 11 dishes …Pakistan has some of the most diverse and flavorful recipes in the world due to the infinite amount of special herbs and spices available, and each traditional dish comes with a deep history that connects it to a particular province. The versatile geography, ranging from deserts to the world’s highest mountain peaks, creates a wide variety of different …"
  },
  {
    "name": "Hungarian",
    "country": "Hungary",
    "dishes": [
      "Arany Galuska",
      "Cabbage Roll",
      "Chicken Paprikash",
      "Dobos Torte",
      "Egg Barley",
      "Esterhazy Torte",
      "Fank",
      "Fisherman's Soup",
      "Főzelék",
      "Goulash",
      "Kaiserschmarrn",
      "Kifli",
      "Kürtőskalács",
      "Lángos",
      "Lecsó",
      "Lentils",
      "Moroccan Meatballs",
      "Mushroom Soup",
      "Palatschinke",
      "Paprikas Csirke"
    ],
    "description": "The cuisine characteristic of the nation of Hungary and its primary ethnic group, the Magyars. Traditional Hungarian dishes are primarily based on meats, seasonal vegetables, fruits, fresh bread, dairy products and cheeses.\nHungarians are especially passionate about their meat stews, casseroles, steaks, roasted pork, beef, poultry, lamb and game. The mixing of different varieties of meats is a traditional feature of Hungarian cuisine. Goulash, stuffed peppers, cabbage rolls, and Fatányéros (Hungarian mixed grill on a wooden platter) are all dishes that can combine beef and pork, and sometimes mutton. Goulash is a stew with more gravy or a soup using meat with bones, paprika, caraway, vegetables (typically carrots and parsley root) and potatoes or various tiny dumplings or pasta simmered with the meat. Other famous Hungarian meat stews include paprikás, a paprika stew with meat simmered in thick creamy paprika gravy, and pörkölt, a Hungarian stew with boneless meat (usually beef or pork), onion, and sweet paprika powder, both served with nokedli (small dumplings). In old fashioned dishes, fruits such as plums and apricots are cooked with meat or in piquant sauces/stuffings for game, roasts and other cuts. Various kinds of noodles and dumplings, potatoes, and rice are commonly served as a side dish. Hungarian sausages (kolbász) and winter salami are a major part of Hungarian cuisine.Vegetarian dishe you find in Hungary"
  },
  {
    "name": "Guyanese",
    "country": "Guyana",
    "dishes": ["Pepperpot"],
    "description": "This cuisine is similar to the rest of the Anglo Caribbean, especially Trinidad, where the ethnic mix is somewhat similar. Dishes have been adapted to Guyanese tastes, often by the addition of herbs and spices. Unique preparations include Guyana Pepperpot, a stew of Amerindian origin made with meat, cassareep (a bitter extract of the cassava), and seasonings. Other favourites are cassava bread, stews, and Metemgee, a thick rich type of soup with a ground provision, coconut milk and large dumplings (called Duff), eaten with fried fish or chicken. Homemade bread-making, an art in many villages, is a reflection of the British influence that includes pastries such as cheese rolls, pine (pineapple) tarts, and patties. Curry is widely popular in Guyana and most types of meat can be carried: chicken, seafood, goat, lamb, and even duck. Guyanese-style Chow Mein is another dish cooked regularly in many homes."
  },
  {
    "name": "Bolivian",
    "country": "Bolivia",
    "dishes": [
      "Aji De Fideos",
      "Aji De Papalisa",
      "Anticuchos",
      "Api",
      "Arroz Con Queso",
      "Buñuelos",
      "Chairo Paceno",
      "Chancaca",
      "Charque",
      "Chicharron",
      "Choripán",
      "Coctel De Tumbo",
      "Cunape",
      "Dulce De Leche",
      "Empanadas Tucumanas",
      "Falso Conejo",
      "Fricasé",
      "Granadilla",
      "Hallulla",
      "Humitas"
    ],
    "description": "Bolivian cuisine is very varied and stems from the combination of Spanish cuisine with Indigenous ingredients and Aymara traditions among others, with later influences from Argentinians, Germans, Italians, Basques, Russians, Poles, and Arabs due to the arrival of immigrants from those countries. The three traditional staples of Bolivian cuisine are corn, potatoes, and beans. These ingredients have been combined with a number of staples brought by the Spanish, such as rice, wheat, and meat, including beef, pork, and chicken.\nhttps://en.wikipedia.org/wiki/Bolivian_cuisineList of common, typical and traditional foods and beverages Bolivians have for breakfast.Street food you find in Bolivia"
  },
  {
    "name": "California",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Turkish",
    "country": "Turkey",
    "dishes": [
      "Acibadem Kurabiyesi",
      "Adana Kebabi",
      "Alinazik Kebab",
      "Anali Kizli Soup",
      "Ash",
      "Ashe Sabzi",
      "Ashure",
      "Ayva Tatlisi",
      "Baklali Enginar",
      "Baklava",
      "Bal Kaymak",
      "Bamiyeh",
      "Bazlama",
      "Beshbarmak",
      "Beyti Kebab",
      "Birds Nest Baklava",
      "Borek",
      "Boyoz",
      "Bulbu Yuvasi",
      "Burma Circles Baklava"
    ],
    "description": "The food of Turkey is the continuation of Ottoman cuisine, which in turn borrowed many elements from Central Asian, Caucasian, Jewish, Middle Eastern, Greek and Balkan cuisines. Turkish cuisine has in turn influenced those and other neighbouring cuisines, including those of Central and Western Europe. The Ottomans fused various culinary traditions of their realm with influences from Levantine cuisines, along with traditional Turkic elements from Central Asia (such as yogurt and mantı), creating a vast array of specialities—many with strong regional associations.\nTurkish cuisine varies across the country. The cooking of Istanbul, Bursa, Izmir, and rest of the Aegean region inherits many elements of Ottoman court cuisine, with a lighter use of spices, a preference for rice over bulgur, koftes and a wider availability of vegetable stews (türlü), eggplant, stuffed dolmas and fish. The cuisine of the Black Sea Region uses fish extensively, especially the Black Sea anchovy (hamsi) and includes maize dishes. The cuisine of the southeast (e.g. Urfa, Gaziantep, and Adana) is famous for its variety of kebabs, mezes and dough-based desserts such as baklava, şöbiyet, kadayıf, and künefe.\nbroad beans = bakla\ndill = dereotuThese are the desserts you should try when you visit Turkey.Who doesn’t love Arabic food? With dishes from the Middle East, such as hummus, found in groceries stores around the world, as well as kebabs and shawarmas, being beloved dishes globally – it’s about time someone talked about Arabic desserts. These are very different from traditional cakes and chocolates, however, they are just as delicious.For those who move beyond the initiation of döner kebab, Turkish cuisine rewards curiosity with time-honed flavors and some of the tastiest street foods in the Mediterranean. Here are 10 Turkish dishes must try.These are the common breakfasts that are eaten all over Turkey."
  },
  {
    "name": "Yemeni",
    "country": "Yemen",
    "dishes": [
      "Areeka",
      "Aseed",
      "Caffè Mocha",
      "Chicken Mandi",
      "Fatoot",
      "Ful Medames",
      "Haneeth",
      "Harees",
      "Hawaij",
      "Jachnun",
      "Kabsa",
      "Karak",
      "Komroh",
      "Kubaneh",
      "Lahoh",
      "Madfoon",
      "Mahalabiya",
      "Malawach",
      "Maluj",
      "Mandi"
    ],
    "description": "Yemeni cuisine is entirely distinct from the more widely known Middle Eastern cuisines, and even differs slightly from region to region. Throughout history, Yemeni cuisine has had a little bit of Ottoman influence in some parts of the north, and very little Mughlai-style Indian influence in Aden and the surrounding areas in the south, but these influences have only come within the last 300 years.\nhttps://en.wikipedia.org/wiki/Yemeni_cuisineYemeni dishesYemen is a small country in the middle east. Most of the popular foods are eaten in almost every country in the middle east. But there is some food which is originated mainly from Yemen. Here is the list of the dishes."
  },
  { "name": "Tibetan", "country": "China", "dishes": [], "description": "" },
  {
    "name": "Chinese",
    "country": "China",
    "dishes": [
      "Almond Biscuit",
      "Annin Tofu",
      "Ban Liang Fen",
      "Bao Bing",
      "Beef Chow Fun",
      "Beef Fried Rice",
      "Beef Lo Mein",
      "Beef Noodles Soup",
      "Beef With Scallions",
      "Birds Nest Soup",
      "Black Sesame Rice Cake",
      "Black Sesame Soup",
      "Black Sesame Tong Yuen",
      "Boortsog",
      "Braised Eggplant",
      "Bubble Tea",
      "Buddhas Delight",
      "Cabbage Roll",
      "Cang Ying Tou",
      "Cantonese Seafood Soup"
    ],
    "description": "Chinese cuisine is the national cuisine of China.\nChinese cuisine includes styles originating from the diverse regions of China, as well as from Chinese people in other parts of the world. The history of Chinese cuisine in China stretches back for thousands of years and has changed from period to period and in each region according to climate, imperial fashions, and local preferences. Over time, techniques and ingredients from the cuisines of other cultures were integrated into the cuisine of the Chinese people due both to imperial expansion and from the trade with nearby regions in pre-modern times, and from Europe and the New World in the modern period.\nStyles and tastes also varied by class, region, and ethnic background. This led to an unparalleled range of ingredients, techniques, dishes and eating styles in what could be called Chinese food, leading Chinese to pride themselves on eating a wide variety of foods while remaining true to the spirit and traditions of Chinese food culture.\nWikiA New Year's celebration wouldn't be complete without sweet treats. Here are some Chinese desserts that are traditionally served during the New Year season.Desserts in China are different from in the West. China is known for many things and Chinese food is certainly one of the most famous items in worldwide cuisine. There are also some popular desserts.China is rich in tourist attractions. Delicious foods are an attraction indispensable in a good tour. With a long history, unique features, numerous styles and exquisite cooking, Chinese cuisine is one important constituent part of Chinese culture. Chinese dishes are famous for color, aroma, taste, meaning and appearance.The following are the eight most popular dishes among foreigners and …List of vegetarian Dishes From Chinese Cuisine"
  },
  {
    "name": "Jewish",
    "country": "Israel",
    "dishes": [
      "Babka",
      "Bagels And Lox",
      "Blintz",
      "Brisket",
      "Carrot Tzimmes",
      "Challah",
      "Chopped Liver",
      "Cornish Hen With Wild Rice And Apple Glaze",
      "Gefilte Fish",
      "Gribenes",
      "Hamantaschen",
      "Hamantash",
      "Jewish Rye Bread",
      "Kashe Varnishkes",
      "Kichel",
      "Knaidlach",
      "Kugel",
      "Pastrami On Rye",
      "Rugelach"
    ],
    "description": "Jewish cuisine is a diverse collection of cooking traditions of the Jewish people worldwide. It has evolved over many centuries, shaped by Jewish dietary laws (kashrut), Jewish Festival, and Shabbat (Sabbath) traditions. Jewish cuisine is influenced by the economics, agriculture, and culinary traditions of the many countries where Jewish communities have settled and varies widely throughout the world.\nThe distinctive styles in Jewish cuisine are Ashkenazi, Sephardi, Mizrahi, Persian, Yemenite, Indian, and Latin-American. There are also dishes from Jewish communities from Ethiopia to Central Asia.\nSince the establishment of the State of Israel in 1948, and particularly since the late 1970s, a nascent Israeli \"fusion cuisine\" has developed. Jewish Israeli cuisine has especially adapted a multitude of elements, overlapping techniques and ingredients from many diaspora Jewish culinary traditions.\nUsing agricultural products from dishes of one Jewish culinary tradition in the elaboration of dishes of other Jewish culinary traditions, as well as incorporating and adapting various other Middle Eastern dishes from the local non-Jewish population of the Land of Israel (which had not already been introduced via the culinary traditions of Jews which arrived to Israel from the various other Arab countries), Israeli Jewish cuisine is both authentically Jewish (and most often kosher) and distinctively local \"Israeli\", yet thoroughly hybridised from its multicultural diasporas Jewish origins. https://en.wikipedia.org/wiki/Jewish_cuisineJewish cuisine has some traditional foods that they mostly eat on different occasions. Here is the list of the traditional dishes from Jewish cuisineThere are many holidays in the Jewish community. On a special occasion, many different kinds of food are made to celebrate the day. Here is the list of Jewish foods served during the Jewish holiday of Purim."
  },
  {
    "name": "Korean",
    "country": "Korea",
    "dishes": [
      "Agujjim",
      "Anju",
      "Banchan",
      "Beef Bulgogi",
      "Beef Short Ribs",
      "Beondegi",
      "Bibimbap",
      "Bibim Guksu",
      "Bindaetteok",
      "Bossam",
      "Budae-Jjigae",
      "Buldak",
      "Bulgogi",
      "Bungeoppang",
      "Candied Sweet Potato",
      "Champon",
      "Chap Chee Noodles",
      "Chapssal Doughnuts",
      "Cheesy Kimchi Fried Rice",
      "Chicken Feet"
    ],
    "description": "Korean cuisine has evolved through centuries of social and political change. Originating from ancient agricultural and nomadic traditions in southern Manchuria and the Korean peninsula, Korean cuisine has evolved through a complex interaction of the natural environment and different cultural trends.\nKorean cuisine is largely based upon rice, vegetables, and meats. Traditional Korean meals are noted for the number of side dishes (banchan) that accompany steam-cooked short-grain rice. Kimchi is served often, sometimes at every meal. Commonly used ingredients include sesame oil, doenjang (fermented bean paste), soy sauce, salt, garlic, ginger, pepper flakes and gochujang (fermented red chili paste).\nIngredients and dishes vary by province. Many regional dishes have become national, and dishes that were once regional have proliferated in different variations across the country. The Korean royal court cuisine once brought all of the unique regional specialties together for the royal family. Meals are regulated by Korean cultural etiquette.\nFrom Wikipedia\nnajki = octopusTraditional food eaten during the celebration of the Korean New YearKorean people like to flavor of food. They use to serve their food of smell, look, colour, vitamin.They have many amazing dishes you should try.Food you find on the street in KoreaKorea is not necessarily known for its sweets, and that’s a shame. These delicious desserts will hopefully change the way you feel about the vast ‘pastry’ heritage that fills the Land of the Morning Calm."
  },
  {
    "name": "Nepalese",
    "country": "Nepal",
    "dishes": [
      "Baji",
      "Chaku",
      "Chhurpi",
      "Chhurpi Soup",
      "Choila",
      "Chowmin",
      "Chunla",
      "Daal Bhath",
      "Dal Bhat",
      "Dhindo",
      "Gujiya",
      "Gundruk",
      "Gwaramari",
      "Halva",
      "Jalebi",
      "Kachilā",
      "Keema",
      "Khoa",
      "Kinema Curry",
      "Kodo Ki Roti"
    ],
    "description": "Nepalese cuisine refers to the food eaten in Nepal.\nNepalese dishes are generally healthier than most other South Asian cuisine, relying less on using fats and more on chunky vegetables, lean meats, pickled ingredients and salads. Whilst Nepal does take heavy influences from its closest geographical companions such as India, China and Tibet, this mountainous country only opened up its borders to outsiders in the 1950s. This factor, in addition to transport and trade difficulties Nepal’s geographical setting, has maintained a focus on using locally grown produce.\nCommon ingredients found across Nepalese cuisine include lentils, potatoes (which are particularly popular within the Newar communities in the Himalayas and Pahar region), tomatoes, cumin, coriander, chilies, peppers, garlic and mustard oil.\nYoghurt, or dahi is popular across Nepal, and is eaten for its healthy attributes and adaptable nature, as it can be used as a side dish or as an ingredient in drinks (Lassi) and desserts (Sikarni). While establishing a group of foods that are distinctly Nepalese is no easy task, there are some dishes that are mainstays when visiting the culturally diverse Nepal. https://theculturetrip.com/asia/nepal/articles/nepalese-food-who…These are the common street food you must try in Nepal.Sikkim is a state in India, near Nepal, Bhutan and China. The foods there are very different because of the fusion of the neighbouring country. Here is the list of dishes from Sikkim, India.Most common food and dishes you find in the Nepal for breakfast."
  },
  {
    "name": "Cambodian",
    "country": "Cammbodia",
    "dishes": [
      "Amok",
      "Amok Trey",
      "Ang Dtray Meuk",
      "Ang Dtray-Meuk",
      "Angkor Beer",
      "Ansom Chek",
      "Bai Sach Chrouk",
      "Bayon Beer",
      "Bok Lahong",
      "Cendol",
      "Chicken Feet",
      "Chuleta Valluna",
      "Fried Spider",
      "Gỏi Cuốn",
      "Green Mango Salad",
      "Hainanese Chicken Rice",
      "Kdam Chaa",
      "Khmer Muslim Beef Curry",
      "Khmer Red Curry",
      "Klang Beer"
    ],
    "description": "Traditional cuisine of the people of Cambodia. Average meals typically consists of more than one dish and ideally contrasts flavours, textures and temperatures within the meal using plenty of herbs, leaves, pickled vegetables, dipping sauces, edible flowers and other garnishes and condiments.\nThe staple food for Cambodians is rice. Today rice is consumed by most Cambodians daily and with all meals, using a great number of cooking styles and techniques. There are hundreds of varieties of indigenous Khmer rice, from the fragrant jasmine-scented malis rice to countless types of wild, brown and sticky rice. Sticky rice is most often consumed as a dessert, often with slices of tropical fruit like mango or durian and coconut milk.\nRice is eaten throughout the day in the form of street-side snacks, such as deep-fried rice cakes with chives and spinach, for breakfast, as in Cambodia's famous rice noodle soup kuyteav or rice porridge, and in many desserts. Plain white rice is served with nearly every family meal, typically served with grilled freshwater fish, a samlor or soup, and an assortment of seasonal herbs, salad leaves and vegetables.Common street food you normally find on the streets of Cambodia"
  },
  {
    "name": "Sri Lankan",
    "country": "Sri Lanka",
    "dishes": [
      "Achcharu",
      "Ala Hodi",
      "Aluwa",
      "Athirasa",
      "Coconut Sambal",
      "Dhal Curry",
      "Egg Hoppers With Sambol",
      "Eggplant Moju",
      "Fish Ambul Thiyal",
      "Gotu Kola Mallung",
      "Green Jackfruit Curry",
      "Hoppers",
      "Kalu Dodol",
      "Kiri Bath",
      "Kiribath With Lunu Miris",
      "Kokis",
      "Kool",
      "Koththu Roti",
      "Kotti Roti",
      "Kukul Mas Curry"
    ],
    "description": "Sri Lankan cuisine has been shaped by many historical, cultural, and other factors. Foreign traders who brought new food items; influences from Indonesian cuisine and the cuisine of Southern India have all helped to shape Sri Lankan cuisine. Today, some of the staples of Sri Lankan cuisine are rice, coconut, and spices. The latter are used due to Sri Lanka's history as a spice producer and trading post over several centuries. https://en.wikipedia.org/wiki/Sri_Lankan_cuisineThis series of lists pertains to breakfast foods and beverages popular in the Sri Lanka.The Teardrop of India or Pearl of the Indian Ocean are among many nicknames for Sri Lanka. But a more accurate description of the gorgeous nation might be the Island of Rice and Curry. Making liberal use of local fruit, such as coconut and jackfruit, seafood and an arsenal of spices, Sri Lankan cooking delivers an abundance of …"
  },
  {
    "name": "Southern",
    "country": "United States of America",
    "dishes": [],
    "description": ""
  },
  { "name": "Caribbean", "country": "Belize", "dishes": [], "description": "" },
  {
    "name": "Mexican",
    "country": "Mexico",
    "dishes": [
      "Adobo Shrimp Tlayuda",
      "Agua De Jamaica",
      "Alambre",
      "Ancho Chilli And Date Chocolate Tart",
      "Arroz Con Huevo",
      "Beef Enchilada Dip",
      "Belizean Salbutes",
      "Birote Salado",
      "Birria",
      "Bizcochito",
      "Black Pudding Tacos",
      "Bolillo",
      "Brazil vs Mexico",
      "Buñuelo",
      "Bunuelo De Molde",
      "Burrito",
      "Cacahuates Japones",
      "Caesar Salad",
      "Café De Olla",
      "Cajeta"
    ],
    "description": "Mexican cuisine is primarily a fusion of indigenous Mesoamerican cooking with European, especially Spanish, elements added after the Spanish conquest of the Aztec Empire in the 16th century. The basic staples remain native foods such as corn, beans and chili peppers, but the Europeans introduced a large number of other foods, the most important of which were meat from domesticated animals (beef, pork, chicken, goat and sheep), dairy products (especially cheese) and various herbs and much spices.\nWhile the Spanish initially tried to impose their own diet on the country, this was not possible and eventually the foods and cooking techniques began to be mixed, especially in colonial era convents. African and Asian influences were also introduced into the mixture during this era as a result of African slavery in New Spain and the Manila-Acapulco Galleons. Over the centuries, this resulted in various regional cuisines, based on local conditions such as those in Oaxaca, Veracruz and the Yucatán Peninsula. Mexican cuisine is closely tied to the culture, social structure and popular traditions of the country. The most important example of this connection is the use of mole for special occasions and holidays, particularly in the South and Center regions of the country. For this reason and others, Mexican cuisine was added by UNESCO to its list of the world’s \"intangible cultural heritage\".\n(Wiki)\nAn average household would usually have 3 big meals a day, desayuno, comida y cena; breakfast being the heartiest one, takes place first thing in the morning, anytime between 7 -10 am. After that comes lunch, also quite heavy, anywhere from 2 to 5pm and dinner is commonly served around 7pm.\nhttps://www.thecuriousmexican.com/breakfast-in-mexico/:\nDuring lunchtime, we tend to indulge in a 4 course meal. We start with a warm soup, followed by the carb choice of rice or pasta, a main dish that could normally be a stew composed of meat and veggies like potatoes, and then followed by a sweet note with a small dessert. This is something you would normally eat at home or you could also find it by the name of comida corrida in small family-owned eateries called fondas.\nDinner, which at times might be called merienda, consists of a small meal or snack to help your body make it through the night. Some people believe that smaller nighttime meals is a healthier way to eat since your body doesn’t need much energy to sleep.\nOf course, all the rules change completely over the weekends, as some people tend to wake up later and/or hungover (no judgement here, we’ve all been there) and usually just have one heavy meal for both breakfast and lunch, think of what you know as brunch, it’s just not called that in México, but if you say almuerzo, most people would understand what you’re talking about.A list of different types of tacos.Oaxaca is one of Mexico's major gastronomic, historical, and gastro-historical centers whose cuisine is known internationally. Here a list of top dishes from Oaxaca.Mexican food is not only delicious but will leave you filled and satisfied. Mexican dishes could be spicy & tastefully. This are the dishes you must try.Mexico is a well known hotbed of culinary action with incredible flavor combinations that easily beat out Tex-Mex wannabes. As the capital of Mexico, Mexico City plays host to some of the top dishes you must try on your next visit. Here are our top 10Food you find on the streets of Mexico"
  },
  {
    "name": "Peruvian",
    "country": "Peru",
    "dishes": [
      "Adobo De Cerdo",
      "Adobo De Pollo",
      "Aeropuerto",
      "Aguadito",
      "Ajiaco De Olluco",
      "Aji De Gallina",
      "Aji De Papalisa",
      "Alfajor",
      "Algarrobina Cocktail",
      "Alpaca",
      "Anticuchos",
      "Arequipeña Beer",
      "Arroz A La Chiclayana",
      "Arroz A La Chiclayana Con Mariscos",
      "Arroz A La Jardinera",
      "Arroz Chaufa",
      "Arroz Chaufa De Mariscos",
      "Arroz Chaufa De Pollo",
      "Arroz Con Huevo",
      "Arroz Con Leche"
    ],
    "description": "Food originally from the country \"Peru\"\nWith influences from the indigenous population including the Inca and cuisines brought in with immigrants from Europe (Spanish cuisine, Italian cuisine, German cuisine), Asia (Chinese cuisine and Japanese cuisine) and West Africa.\nCommon ingredients translation:\nArroz - Rice\nPollo - Chicken\nCabrito - Young goat\nChancho - Pork\nCordero - Young lamb\nPallares - Lima beansPeru is the Hope Diamond of Latin America, home to dishes and flavors you won't find anywhere else. While this is hardly a secret—there are more Peruvian restaurants outside Peru than ever before—it's one we don't give enough credit. Few places on earth offer such a variety of indigenous ingredients, let alone a jumble of flavors and techniques …This list pertains to breakfast foods and beverages popular in Peru. The typical holiday or weekend Peruvian breakfast usually consists of tamal, french bread, pork chicharron, fruit smoothie, and coffee with evaporated milk. Other items can include sangrecita (blood sausage) and salchicha de huacho (scrambled eggs with sausage).List of Peruvian dishes for the non adventurous or picky eaters. This dishes are not too spicy, are not exotic and on the \"safe\" side. Very easy to eat and popular with the tourist or first timers visiting of PeruList of most common soups from peruThis is a list of food or dishes that are considered exotic in Peru."
  },
  {
    "name": "Afghan",
    "country": "Afghanistan",
    "dishes": [
      "Afghan Kofta",
      "Aushak",
      "Bichak",
      "Bolani",
      "Brides Fingers",
      "Challow",
      "Chapli Kebab",
      "Doogh",
      "Firni",
      "Gosh Feel",
      "Kabuli Palaw",
      "Kadu Bouranee",
      "Kahwa",
      "Keshk",
      "Khameerbob",
      "Khoujoor",
      "Kitchiree Quroot",
      "Korma Shalgam",
      "Kulcha Khatai",
      "Murabba"
    ],
    "description": "The Cuisine from Afghanistan is largely based upon the nation's chief crops, such as wheat, maize, barley and rice. Accompanying these staples are native fruits and vegetables as well as dairy products such as milk, yogurt and whey. Kabuli Palaw is the national dish of Afghanistan. The nation's culinary specialties reflect its ethnic and geographic diversity. Afghanistan is known for its high quality pomegranates, grapes and sweet football-shaped melons.\nChaWal = Rice\nDhaniya = Coriander\nHaldi = Tumeric\nLaal Mirch = Red chilli\nLehsan Adrak = Ginger garlic\nMoong Daal (Chilky Vali) = Green gram split peas\nNamak = Salt\nPalak = Spinch\nPani = Water\nPyaaz = Onion\nQeema = Mince\nZeera = Cumin"
  },
  {
    "name": "Dominican",
    "country": "Dominican Republic",
    "dishes": [
      "Asopao De Pollo",
      "Bacalao Guisado",
      "Batata Frita",
      "Batida De Lechoza",
      "Broth",
      "Casabe",
      "Chapea",
      "Chimichurri",
      "Chivo Guisado",
      "Chuleta A La Parrilla",
      "Dominican Breakfast",
      "Dulce De Coco",
      "Habichuelas Con Dulce",
      "Habichuelas Guisadas",
      "Jugo De Chinola",
      "La Bandera",
      "Locrio",
      "Maduros",
      "Majarete",
      "Mamajuana"
    ],
    "description": "cuisine is predominantly made up of a combination of Spanish, indigenous Taíno, and African influences. Many Middle-Eastern dishes have been adopted into Dominican cuisine, such as the \"Quipe\" that comes from the Lebanese kibbeh. Dominican cuisine resembles that of other countries in Latin America, those of the nearby islands of Puerto Rico and Cuba, most of all, though the dish names differ sometimes.\nA traditional breakfast would consist of mangú, sauteed onions, fried eggs, fried salami, fried cheese and sometimes avocado. This is called \"Los Tres Golpes\" or \"The Three Hits\". As in Spain, the largest, most important meal of the day is lunch. Its most typical form, nicknamed La Bandera (\"The Flag\"), consists of rice, red beans and meat (beef, chicken, pork, or fish), sometimes accompanied by a side of salad.\nhttp://en.wikipedia.org/wiki/Dominican_Republic_cuisine"
  },
  {
    "name": "Austrian",
    "country": "Austria",
    "dishes": [
      "Brettljause",
      "Buchteln",
      "Cat Tongue",
      "Erdäpfelsalat",
      "Esterhazy Torte",
      "Fiakergulasch",
      "Kaiserschmarrn",
      "Kardinalschnitte",
      "Kasespatzle",
      "Knodel",
      "Landjäger",
      "Linzer Torte",
      "Liptau Spread",
      "Martinigans",
      "Potato Gulasch",
      "Powidltascherl",
      "Pretzel",
      "Ricet",
      "Spargel",
      "Tafelspitz"
    ],
    "description": "Over the hundreds of years of Austria's existence, a unique tradition of Austrian Cuisine has emerged. Its traditional and well-known recipes attract millions of tourists each year. Austria's rich Cuisine is a result of its history as a multi-national empire, where all kinds of different cultures contributed their very own nuances.Austria is a country in Europe. There many delicious dishes that are quite famous in Austria. Here is the list of dishes that you must eat."
  },
  {
    "name": "New Zealand",
    "country": "New Zealand",
    "dishes": [
      "Afghan Biscuit",
      "Anzac Biscuit",
      "Bacon Butty",
      "Beef Pie",
      "Chocolate Crackles",
      "Fish And Chips",
      "Fried Halloumi Cheese",
      "Kiwi Burger",
      "Kiwi Pavlova.",
      "Kumara Tandoori Salad",
      "Lolly Cake",
      "Meat Pie",
      "Parāoa Rēwena",
      "Sausage Sizzle"
    ],
    "description": "It is largely driven by local ingredients and seasonal variations. An island nation with a primarily agricultural economy, New Zealand yields produce from land and sea. Similar to the cuisine of Australia, the cuisine of New Zealand is a diverse British-based cuisine, with Mediterranean and Pacific Rim influences as the country becomes more cosmopolitan.\nIn New Zealand households, dinner is the main meal of the day, when families gather and share their evening together. Restaurants and takeaways provide an increasing proportion of the diet."
  },
  {
    "name": "Danish",
    "country": "Denmark",
    "dishes": [
      "Bofsandwich",
      "Braendende Kaerlighed",
      "Butter Cookie",
      "Buttermilk Koldskål",
      "Danish Pastry",
      "Denmark vs France",
      "Elephant Beer",
      "Kringle",
      "Liver Pate",
      "Remonce",
      "Reparationsbajer Beer",
      "Ribbensteg",
      "Risalamande",
      "Schokokuss",
      "Smorrebrod",
      "Stegt Flaesk",
      "Tarteletter"
    ],
    "description": "Danish food culture and culinary heritage - has been cultivated and improved for many generations - and is mainly rooted from the old country kitchen - with ancient food recipes from all over the Danish kingdom - created first and foremost - as a shield to protect the Danes against the cold weather conditions in Denmark. That’s why the Danes for centuries have eaten a lot of meat - especially loads of pork - but also beef together with plenty of potatoes and vegetables. Poultry and fish products are the Danes second choice. The cold and often wet climate in Denmark requires a lot of food with high nutritional values that contain many vitamins - minerals and proteins to mobilise a great portion of energy - which is a vital source - needed for work - at school - for sports and another form of daily activities - when living in a dynamic and modern society like Denmark that demands plenty of individual energy and human recourses every day."
  },
  {
    "name": "Icelandic",
    "country": "Iceland",
    "dishes": [
      "Brennivin",
      "Croatia vs Iceland",
      "Dark Rye Bread",
      "Flatkaka",
      "Hákarl",
      "Hjónabandsæla",
      "Icelandic Chocolate Porridge",
      "Icelandic Kleinur",
      "Icelandic Pepper Cookies",
      "Icelandic Skyr Cake",
      "Leaf Bread",
      "Ponnukokur",
      "Porramatur",
      "Pylsur",
      "Skyr",
      "Vinarterta"
    ],
    "description": "The cuisine of Iceland has a long history. Important parts of Icelandic cuisine are lamb, dairy, and fish, the latter due to Iceland's being surrounded by ocean. Popular foods in Iceland include skyr, hangikjöt (smoked lamb), kleinur, laufabrauð and bollur. Þorramatur is a traditional buffet served at midwinter festivals called Þorrablót; it includes a selection of traditionally cured meat and fish products served with rúgbrauð (dense dark and sweet rye bread) and brennivín (an Icelandic akvavit). The flavours of this traditional country food originate in its preservation methods; pickling in fermented whey or brine, drying and smoking.\nhttps://en.wikipedia.org/wiki/Icelandic_cuisineThese dishes are served during Christmas in Iceland.These are the dishes you have to try when you visit Iceland."
  },
  {
    "name": "Punjabi",
    "country": "India",
    "dishes": [
      "Butter Chicken",
      "Roti",
      "Tandoori Chicken",
      "Chole Bhature",
      "Masala Channa",
      "Dal Makhani",
      "Machchli Amritsari",
      "Dhaba Dal",
      "Paneer Tikka",
      "Murgh Malaiwala",
      "Amritsari Kulcha"
    ],
    "description": "Punjabi cuisine is a culinary style originating in the Punjab, a region in the northern part of the Indian subcontinent, which is now divided in an Indian part and a Pakistani part. This cuisine has a rich tradition of many distinct and local ways of cooking. One is a special form of tandoori cooking that is now famous in other parts of India, UK, Canada, Hong Kong and in many parts of the world. The local cuisine of Punjab is heavily influenced by the agriculture and farming lifestyle prevalent from the times of the ancient Indus Valley Civilization. Locally grown staple foods form the major part of the local cuisine. Distinctively Punjabi cuisine is known for its rich, buttery flavours along with the extensive vegetarian and meat dishes. Main dishes include sarhon d sag (a stew whose main ingredient is mustard greens) and makki di roti (flatbreads made with cornmeal). https://en.wikipedia.org/wiki/Punjabi_cuisine"
  },
  {
    "name": "Filipino",
    "country": "Philippines",
    "dishes": [
      "Adobong Pusit",
      "Adobo Sa Luyang Dilaw",
      "Alfajor",
      "Apas",
      "Arroz Caldo",
      "Bagnet",
      "Balut",
      "Bam-I",
      "Banana Cue",
      "Baye Baye",
      "Beef Caldereta",
      "Beef Mechado",
      "Beef Tapa",
      "Belekoy",
      "Bibingka",
      "Bicol Express",
      "Biko",
      "Binaki",
      "Binatog",
      "Binignit"
    ],
    "description": "Philippine cuisine consists of the food, preparation methods and eating customs found in the Philippines. The style of cooking and the food associated with it have evolved over many centuries from its Austronesian origins to a mixed cuisine of Malay, Spanish, Chinese, and American, as well as other Asian and Latin influences adapted to indigenous ingredients and the local palate.\nDishes range from the very simple, like a meal of fried salted fish and rice, to the elaborate paellas and cocidos created for fiestas of Spanish origin, and spaghetti and lasagna of Italian origin. Popular dishes include: lechón (whole roasted pig), longganisa (Philippine sausage), tapa (cured beef), torta (omelette), adobo (chicken and/or pork braised in garlic, vinegar, oil and soy sauce, or cooked until dry), kaldereta (meat in tomato sauce stew), mechado (larded beef in soy and tomato sauce), puchero (beef in bananas and tomato sauce), afritada (chicken and/or pork simmered in a peanut sauce with vegetables), kare-kare (oxtail and vegetables cooked in peanut sauce), pinakbet (kabocha squash, eggplant, beans, okra, and tomato stew flavored with shrimp paste), crispy pata (deep-fried pig's leg), hamonado (pork sweetened in pineapple sauce), sinigang (meat or seafood in sour broth), pancit (noodles), and lumpia (fresh or fried spring rolls).\n-Wikipedia-\nmerienda = breakfast, lunch, snack and\nmerienda cena = Dinner\nItlog = eggs\nPancit, pansit = noodlesChristmas food that are staples of every Filipino Noche Buena table.Filipino cuisine is based on a mixture of different traditional foods of India, Spain, China and America.List of vegetarian dishes from the Filipino cuisineList of dishes that are normally consumed for breakfast in the Philippines.List of street food you can find in the Philippines."
  },
  {
    "name": "Chilean",
    "country": "Chile",
    "dishes": [
      "Ajiaco",
      "Arrollado Huaso",
      "Barros Jarpa",
      "Bistec A Lo Pobre",
      "Bisteck A La Chorrillana",
      "Caldillo De Congrio",
      "Carbonada",
      "Cazuela",
      "Cazuela Nogada",
      "Chacarero",
      "Chancaca",
      "Chancho En Piedra",
      "Chapalele",
      "Charqui De Caballo",
      "Chilenitos",
      "Chorrillana",
      "Chunchules Con Harina Tostada",
      "Cola De Mono",
      "Completo",
      "Curanto"
    ],
    "description": "Cuisine from Chile stems mainly from the combination of traditional Spanish cuisine, Chilean Indigenous Mapuche culture and local ingredients, with later important influences from other European cuisines, particularly from Germany, Italy and France. The food tradition and recipes in Chile are notable for the variety of flavours and ingredients, with the country’s diverse geography and climate hosting a wide range of agricultural produce, fruits and vegetables. The long coastline and the peoples' relationship with the Pacific Ocean add an immense array of seafood products to Chilean cuisine, with the country's waters home to unique species of fish, molluscs, crustaceans and algae, thanks to the oxygen-rich water carried in by the Humboldt Current. Chile is also one of the world’s largest producers of wine and many Chilean recipes are enhanced and accompanied by local wines.List of dishes you can find on the streets of Chile"
  },
  {
    "name": "Cajun",
    "country": "United States of America",
    "dishes": ["Crawfish/shrimp boil","Jambalaya","Gumbo","Po Boy Sandwich","Maque choux","Pain perdu", "Boudin"],
    "description": "ajun cuisine (French: Cuisine cadienne, [kizin kadn]), (Spanish: Cocina acadia) is a style of cooking developed by the Cajun - Acadians who were deported from Acadia to Louisiana during the 18th century and who incorporated West African, French and Spanish cooking techniques into their original cuisine. Cajun cuisine is sometimes referred to as a 'rustic cuisine', meaning that it is based on locally available ingredients and that preparation is relatively simple. An authentic Cajun meal is usually a three-pot affair, with one pot dedicated to the main dish, one dedicated to steamed rice, specially made sausages, or some seafood dish, and the third containing whatever vegetable is plentiful or available. Crawfish, shrimp, and andouille sausage are staple meats used in a variety of dishes. The aromatic vegetables green bell pepper (piment doux), onion, and celery are called \"the trinity\" by Cajun chefs in Cajun and Louisiana Creole cuisines. https://en.wikipedia.org/wiki/Cajun_cuisine"
  },
  {
    "name": "Balearic",
    "country": "Spain",
    "dishes": [
      "Arròs Brut",
      "Ensaïmada",
      "Ensaimada De Mallorca",
      "Greixonera",
      "Greixonera De Brossat",
      "Oliaigua",
      "Sobrassada",
      "Trempó"
    ],
    "description": "It is a Mediterranean cuisine as cooked in the Balearic Islands, Spain. It can be regarded as part of a wider Catalan cuisine, since it shares many dishes and ingredients with Catalonia and the Valencian Community. Others view it as part of a more global Spanish cuisine. Traditional Balearic cuisine is rich in vegetables, cereal and legumes as well as being low in fats. A succinct selection of the primary dishes would be ensaimades, seafood and vegetable stews, sobrassada, coques, tombet, Maó cheese and wine.Balearic Island is an Island in Spain. The food on the island is very little known. There are some delicious foods in Balearic island. Here is the list of the foods from Balearic Island."
  },
  {
    "name": "Portuguese",
    "country": "Portugal",
    "dishes": [
      "Alcatra",
      "Arroz De Feijao",
      "Arroz De Marisco",
      "Arroz De Tomate",
      "Bacalhau",
      "Bacalhau A Bras",
      "Bifana",
      "Bitoque",
      "Bolo De Milho",
      "Bolo Do Caco",
      "Bolo Dona Amelia",
      "Bolo Rei",
      "Bolos Levedos",
      "Broa",
      "Cabidela",
      "Cachorro",
      "Caldo Verde",
      "Carne De Porco Alentejana",
      "Cozido",
      "Dulce De Leche Cheesecake"
    ],
    "description": "The Cuisine from Portugal despite being relatively restricted to an Atlantic sustenance, Portuguese cuisine has many Mediterranean influences. Portuguese cuisine is famous for seafood. The influence of Portugal's former colonial possessions is also notable, especially in the wide variety of spices used. These spices include piri piri (small, fiery chili peppers) and black pepper, as well as cinnamon, vanilla and saffron. Olive oil is one of the bases of Portuguese cuisine, which is used both for cooking and flavouring meals. Garlic is widely used, as are herbs, such as bay leaf and parsley."
  },
  {
    "name": "Somali",
    "country": "Somalia",
    "dishes": ["Bariis Iskukaris", "Sabaayad", "Shaah"],
    "description": "Somali cuisine varies from region to region and is a fusion of different Somali culinary traditions. It is the product of Somalia's tradition of trade and commerce. Some notable Somali delicacies include Sabaayad/Kimis, Laxooh/Canjeero, xalwo, sambuusa, bariis iskukaris, and Muqmad/Odkac (beef jerky). Wikipedia"
  },
  {
    "name": "Ecuadorian",
    "country": "Ecuador",
    "dishes": [
      "Aguado De Gallina",
      "Arroz Con Camarones",
      "Arroz Con Huevo",
      "Arroz Con Menestra",
      "Arroz Con Menestra De Lentejas",
      "Arroz Con Pollo",
      "Arroz Marinero",
      "Bolon De Verde",
      "Canelazo Cocktail",
      "Champús",
      "Chaulafán",
      "Chifles",
      "Churrasco",
      "Corviches",
      "Dulce De Leche",
      "Empanadas De Verde",
      "Empanadas De Viento",
      "Encebollado",
      "Espumillas",
      "Fanesca"
    ],
    "description": "Ecuadorian cuisine is diverse, varying with altitude, and associated agricultural conditions. Pork, chicken, beef, and cuy (guinea pig) are popular in the mountainous regions, and are served with a variety of carbohydrate-rich foods, especially rice, corn, and potatoes. A popular street food in mountainous regions is hornado, consisting of potatoes served with roasted pig. Some examples of Ecuadorian cuisine in general include patacones (unripe plantains fried in oil, mashed up, and then refried), llapingachos (a pan seared potato ball), and seco de chivo (a type of stew made from goat). A wide variety of fresh fruit is available, particularly at lower altitudes, including granadilla, passionfruit, naranjilla, several types of bananas, uvilla, taxo, and tree tomato.\nThe food is somewhat different in the southern mountainous areas, featuring typical Loja food such as repe, a soup prepared with green bananas; cecina, roasted pork; and miel con quesillo or \"cuajada\", as dessert. In the rainforest, a dietary staple is the yuca, elsewhere called cassava. The starchy root is peeled and boiled, fried, or used in a variety of other dishes. It's also used as a bread, and has spread throughout the nation, most notably, to Quito where a company sells the native pan de yuca in a new sense; different types sold with frozen yogurt. Many fruits are available in this region, including bananas, tree grapes, and peach palms. https://en.wikipedia.org/wiki/Ecuadorian_cuisineFood Ecuadorians normally eat for breakfast.List of dishes that people in Ecuador normally eat for lunch."
  },
  {
    "name": "Burmese",
    "country": "Myanmar",
    "dishes": [
      "Burmese Biryani",
      "Burmese Khowsuey",
      "Cendol",
      "Chargrilled Eggplant With Prawns",
      "Dunt Dalun Chin Hin",
      "Green Onion Pancake",
      "Khauk Swe Thoke",
      "Kulfi",
      "Kyay Oh",
      "Lahpet",
      "Mohinga",
      "Pe Htaw Bhut Htamin",
      "Pickled Tea Leaf Salad",
      "Pork With Pickle Mango"
    ],
    "description": "Burmese cuisine includes dishes from various regions of the Southeast Asian country of Burma (now officially known as Myanmar). The diversity of Myanmar's cuisine has also been contributed to by the myriad of local ethnic minorities. The Bamars are the most dominant group, but other groups including the Chin people also have distinct cuisines.\nBurmese cuisine is characterized by extensive use of fish products like fish sauce and ngapi (fermented seafood). Owing to the geographic location of Myanmar, Burmese cuisine has been influenced by Chinese cuisine, Indian cuisine and Thai cuisine.\nWiki"
  },
  {
    "name": "Soul Food",
    "country": "United States of America",
    "dishes": ["Fatback", "Fried Chicken", "Fried Fish","Ham hocks","Hog Jowl","Hog maw","Offal", "Ox tail", "Pork Ribs", "Sweet Potato Pie"],
    "description": "Soul food is an ethnic cuisine traditionally prepared and eaten by African Americans, originating in the Southern United States. The cuisine originated with the foods that were given to enslaved African Americans by English Americans on southern plantations during the American colonial period; however, it was strongly influenced by the traditional practices of West Africans and Native Americans from its inception. Due to the historical presence of African Americans in the region, soul food is closely associated with the cuisine of the American South although today it has become an easily identifiable and celebrated aspect of mainstream American food culture. https://en.wikipedia.org/wiki/Soul_food"
  },
  {
    "name": "Ethiopian",
    "country": "Ethiopia",
    "dishes": [
      "Atkilt Wot",
      "Awaze",
      "Azifa",
      "Beet Salad",
      "Berbere",
      "Buticha",
      "Butter Coffee",
      "Casado",
      "Chechebsa",
      "Dabo Kolo",
      "Derek Tibs",
      "Doro Tibs",
      "Doro Wat",
      "Fasolia",
      "Fit-Fit",
      "Genfo",
      "Gomen Be Siga",
      "Gomen Wat",
      "Gored Gored",
      "Himbasha"
    ],
    "description": "Ethiopian cuisine characteristically consists of vegetable and often very spicy meat dishes. This is usually in the form of wat (also w'et or wot), a thick stew, served atop injera, a large sourdough flatbread, which is about 50 centimeters (20 inches) in diameter and made out of fermented teff flour. Ethiopians eat exclusively with their right hands, using pieces of injera to pick up bites of entrées and side dishes. Utensils are optional.\nThe Ethiopian Orthodox Church prescribes a number of fasting (tsom, Ge'ez: ጾም ṣōm) periods, including Wednesdays, Fridays, and the entire Lenten season, so Ethiopian cuisine contains many dishes that are vegan. https://en.wikipedia.org/wiki/Ethiopian_cuisine\nBe Siga, Besiga = Meat\nDoro = chicken\nGomen = Collard Greens\nIngudai = mushroom\nTibs = saute\nwat = stewList of dishes you should try from EthiopiaList of Vegetarian Dishes From Ethiopian Cuisine"
  },
  {
    "name": "Saudi Arabian",
    "country": "Saudi Arabia",
    "dishes": ["Harees", "Kabsa", "Kuwaiti", "Mathlotha", "Saleeg", "Suhor"],
    "description": "The Arabian people have consumed the same type of food for thousands of years. Some of the common food items in Saudi Arabian cuisine include wheat, rice, lamb, chicken, yogurt, potatoes and dates. Traditional coffeehouses (Maqha) used to be ubiquitous, but are now being displaced by food-hall style cafes. According to the Saudi Arabian Cultural Mission, \"serving Gahwah (Coffee) in Saudi Arabia is a sign of hospitality and generosity\". Traditionally, the coffee beans were roasted, cooled and ground in front of the guests using a mortar and pestle. The host would then add cardamom pods to the coffee beans during the grinding process. Once the coffee is brewed, it is poured for guests. Today, Gahwah is not prepared in front of the guests; instead it is elegantly served in a Dallah and poured into small cups called Finjan.\nhttps://en.wikipedia.org/wiki/Saudi_Arabian_cuisine"
  },
  {
    "name": "Hong Kong",
    "country": "China",
    "dishes": [
      "Annin Tofu",
      "Birds Nest Soup",
      "Black Sesame Tong Yuen",
      "Cífàntuán",
      "Egg Tart",
      "Egg Waffle",
      "Grass Jelly",
      "Horng Ryen Jen Sandwich",
      "Mango Pomelo Sago",
      "Marraqueta",
      "Nuomici",
      "Ox-Tongue Pastry",
      "Pineapple Bun",
      "Red Bean Ice",
      "Sago Soup",
      "Snow Skin Mooncake",
      "Sweetheart Cake",
      "Sweet Potato Soup"
    ],
    "description": "Hong Kong cuisine is mainly influenced by Cantonese cuisine, non-Cantonese Chinese cuisine (especially Teochew, and Hakka, Hokkien and the Jiangsu & Zhejiang), the Western world, Japan, and Southeast Asia, due to Hong Kong's past as a British colony and long history of being an international city of commerce. From the roadside stalls to the most upscale restaurants, Hong Kong provides an unlimited variety of food in every class. Complex combinations and international gourmet expertise have given Hong Kong the reputable labels of \"Gourmet Paradise\" and \"World's Fair of Food\""
  },
  { "name": "Sichuan", "country": "China", "dishes": [], "description": "" },
  {
    "name": "Tunisian",
    "country": "Tunisia",
    "dishes": [
      "Asida",
      "Assidat Zgougou",
      "Bambalouni",
      "Boukha",
      "Brik",
      "Couscous",
      "Fricasse",
      "Ghoriba",
      "Harissa",
      "Kabkabou",
      "Kamounia",
      "Keleya Zaara",
      "Lablabi",
      "Maghrebi Mint Tea",
      "Mechouia Salad",
      "Tajin Sibnekh",
      "Usban"
    ],
    "description": "Tunisian cuisine, the cuisine of Tunisia, is a blend of Mediterranean and desert dwellers' culinary traditions. Its distinctive spicy fieriness comes from the many civilizations which have ruled the land now known as Tunisia: Romans, Vandals, Byzantines, Arabs, Spanish, Turkish, Italians, French, and the native Punics-Berber people. Many of the cooking styles and utensils began to take shape when the ancient tribes were nomads. Nomadic people were limited in their cooking implements by what pots and pans they could carry with them. The Tunisian tagine, is very different from the Moroccan dish. It is a type of a pie dish, made out of eggs, meat and vegetables, similar to the Italian frittata or the eggah.\nThe openness to trade and tourism also brought international cuisines, like the Chinese, Indian, Japanese cuisine, or fast-food. Moreover, the intensification of commercial exchange with Europe and the rest of the world, made certain uncommon products available, which in turn allowed locals to experiment with other cuisines.\nLike all countries in the Mediterranean basin, Tunisia offers a \"sun cuisine,\" based mainly on olive oil, spices, tomatoes, seafood and meat."
  },
  {
    "name": "Nigerian",
    "country": "Nigeria",
    "dishes": [
      "Agege Bread",
      "Akara",
      "Argentina vs Nigeria",
      "Boli",
      "Boli And Epa",
      "Cassava Fufu",
      "Chapman",
      "Chin Chin",
      "Ewa Agoyin",
      "Ewa Agoyin And Agege Bread",
      "Garri",
      "Kachumbari",
      "Kunu Zaki",
      "Moin Moin",
      "Nigerian Bambara Nut Moi-Moi",
      "Ogi",
      "Pepper Snail",
      "Plantain Chips",
      "Roasted Groundnut",
      "Roasted Plantain And Pepper Sauce"
    ],
    "description": "Nigerian cuisine consists of dishes or food items from the hundreds of ethnic groups that comprise Nigeria. Like other West African cuisines, it uses spices and herbs with palm or groundnut oil to create deeply flavored sauces and soups. WikipediaStreet foods are consumed by Nigerian people. People from Nigeria loves to eat street foods. They have plenty of option to eat street foods"
  },
  {
    "name": "Jamaican",
    "country": "Jamaica",
    "dishes": [
      "Ackee & Saltfish",
      "Asham",
      "Bammy",
      "Beef Patty",
      "Bulla Cake",
      "Busta Coconut Sweets",
      "Chicken Feet",
      "Coco Bread",
      "Coconut Drop",
      "Cornmeal Pudding",
      "Cow Cod Soup",
      "Curried Goat Stew",
      "Curry Chicken",
      "Gizzada",
      "Hard Dough Bread",
      "Hummingbird Cake",
      "Jamaican Blue Draws",
      "Jamaican Fried Snapper",
      "Jamaican Run Down",
      "Jerk Chicken"
    ],
    "description": "Jamaican cuisine includes a mixture of cooking techniques, flavours, spices and influences from the indigenous people on the island of Jamaica, and the Spanish, British, Africans, Indian and Chinese who have inhabited the island. It is also influenced by the crops introduced into the island from tropical Southeast Asia. Jamaican cuisine includes various dishes from the different cultures brought to the island with the arrival of people from elsewhere. Other dishes are novel or a fusion of techniques and traditions. In addition to ingredients that are native to Jamaica, many foods have been introduced and are now grown locally. A wide variety of seafood, tropical fruits and meats are available.\nhttps://en.wikipedia.org/wiki/Jamaican_cuisineThese mouth-watering Jamaican desserts are worth a try."
  },
  {
    "name": "Brazilian",
    "country": "Brazil",
    "dishes": [
      "Acaraje",
      "Antarctica Beer",
      "Anthill Cake",
      "Arroz Con Pollo",
      "Bauru",
      "Beer Brigadeiros",
      "Beijinho",
      "Beijinho De Coco",
      "Beiju",
      "Bem Casado",
      "Berry Caipile Cocktail",
      "Black Bean And Sausage Soup",
      "Bobo De Camarao",
      "Bolinho De Chuva",
      "Bolo De Rolo",
      "Brazilian Coconut Fish Stew",
      "Brazil vs Mexico",
      "Brazil vs Serbia",
      "Brigadeiro",
      "Brigadeiro Ice Cream"
    ],
    "description": "Brazilian cuisine has European, African and Amerindian influences. It varies greatly by region, reflecting the country's mix of native and immigrant populations, and its continental size as well. This has created a national cuisine marked by the preservation of regional differences.\nIngredients first used by native peoples in Brazil include cassava, guaraná, açaí, cumaru and tacacá. From there, the many waves of immigrants brought some of their typical dishes, replacing missing ingredients with local equivalents. For instance, the European immigrants (primarily from Portugal, Italy, Spain, Germany, Poland and Switzerland) were accustomed to a wheat-based diet, and introduced wine, leaf vegetables, and dairy products into Brazilian cuisine. When potatoes were not available they discovered how to use the native sweet manioc as a replacement. The African slaves also had a role in developing Brazilian cuisine, especially in the coastal states. The foreign influence extended to later migratory waves - Japanese immigrants brought most of the food items that Brazilians would associate with Asian cuisine today, and introduced large-scale aviaries, well into the 20th century.\nhttp://en.wikipedia.org/wiki/Brazilian_cuisineDishes eaten on Christmas season in BrazilList of traditional fast food dishes that is sold at food stalls and cookshops in Brazil.Five Traditional Brazilian Foods You Need To Eat Right Now. You haven't lived until you try all of these!Top Traditional Brazilian Foods You Need To Eat Right Now You haven't lived until you try all of these!Don't leave Brazil without trying these 10 amazing Brazilian's dish."
  },
  {
    "name": "French",
    "country": "France",
    "dishes": [
      "Aioli",
      "Aligot",
      "Alsace Onion Tart",
      "Amandine",
      "Andouille",
      "Andouillette",
      "Baeckeoffe",
      "Baguette",
      "Baked Alaska",
      "Bavarian Cream",
      "Beef Bourguignon",
      "Beignet",
      "Bichon Au Citron",
      "Bisque",
      "Blancmange",
      "Blanquette De Veau",
      "Bonbon",
      "Boudin Noir Aux Pommes",
      "Bouillabaisse",
      "Boule"
    ],
    "description": "French cuisine (French: cuisine française, IPA: [k?i.zin f??~.s?z]) consists of cooking traditions and practices from France, famous for rich tastes and subtle nuances with a long and rich history. France, a country famous for its agriculture and independently minded peasants, was long a creative powerbase for delicious recipes, that are both healthy and refined. http://en.wikipedia.org/wiki/French_cuisinetraditional food served in or near ChristmasList of traditional fast food dishes that is sold at food stalls and cookshops in France.Best Popular French Pasties"
  },
  {
    "name": "Salvadorean",
    "country": "El Salvador",
    "dishes": [],
    "description": ""
  },
  {
    "name": "Venezuelan",
    "country": "Venezuela",
    "dishes": [
      "Arepa",
      "Asado Negro",
      "Besitos De Coco",
      "Bien Me Sabe",
      "Cachapas",
      "Cachitos",
      "Chivo Al Coco",
      "Dulce De Leche",
      "Dulce De Lechoza",
      "Empanada De Pabellon",
      "Ensalada De Gallina",
      "Frijoles Negros",
      "Golfeados",
      "Hallaca",
      "Mandoca",
      "Marquesa De Almendras",
      "Morcilla",
      "Pabellon Criollo",
      "Pan De Jamon",
      "Pan Frances"
    ],
    "description": "Due to its location in the world, its diversity of industrial resources and the cultural diversity of the Venezuelan people, Venezuelan cuisine often varies greatly from one region to another. Its cuisine, traditional as well as modern, is influenced by indigenous peoples and its European ancestry (Italian, Spanish, Portuguese, and French), and is also influenced by African and Native American traditions. Food staples include corn, rice, plantain, yams, beans and several meats. Potatoes, tomatoes, onions, eggplants, squashes and zucchini are also common sides in the Venezuelan diet.List of dishes, foods, and beverages that are normally consumed for breakfast in Venezuela.List of traditional fast food dishes that is sold at food stalls and cookshops in VenezuelaDishes served in Venezuela around the holidays"
  },
  {
    "name": "Uruguayan",
    "country": "Uruguay",
    "dishes": [
      "Alfajor",
      "Asado De Tira",
      "Chaja",
      "Chivito",
      "Dulce De Batata",
      "Grilled Pork Sausage",
      "Ham And Cheese Empanadas",
      "Matambre",
      "Mate",
      "Pastafrola",
      "Pionono",
      "Torta Frita"
    ],
    "description": "The Cuisine from Uruguay is a fusion of Indigenous Charruan cuisine and the cuisines of several European countries, with a particular emphasis on Mediterranean food from Spain, Italy, Portugal and France. Other possible influences on the cuisine may result from immigration from countries such as Germany and Britain. The food is very similar to Argentine cuisine.\nThe base of the country's diet is meat and animal products, mostly coming from beef but also chicken, lamb, pig and sometimes fish.\nUruguayan gastronomy came from immigration, and surprisingly did not come from the Amerindians, because the new colonies did not trust the natives. The preferred cooking methods for meats and vegetables are still boiling and roasting, but with modernization also came frying (see milanesas and chivitos). Meanwhile, wheat and fruit comes mostly fried (torta frita and pasteles), comfited (rapadura and ticholos de banana) and sometimes baked (rosca de chicharrones), which is a new modern style.\nAlthough Uruguay has exuberant flora and fauna, with the exception of yerba mate, the rest of it is mostly still unused. Consumption of fresh fruit is rare, and when fruit is eaten, it is not from locally grown areas.\nUruguayan food always comes with fresh bread; bizcochos and tortas fritas are a must for drinking with mate ('tomar el mate')."
  },
  {
    "name": "Indonesian",
    "country": "Indonesia",
    "dishes": [
      "Acar Awak",
      "Apam Balik",
      "Ayam Cemani Black Chicken",
      "Ayam Pelalah",
      "Ayam Penyet",
      "Bakmi",
      "Bakpia Pathok",
      "Bakso",
      "Banana Chip",
      "Batagor",
      "Beef Rendang",
      "Bika Ambon",
      "Bubur Kacang Hijau",
      "Bubur Sagu Mutiara",
      "Bubur Sumsum",
      "Cendol",
      "Chicken Satay",
      "Coconut Fish Cakes",
      "Corn Cookie",
      "Corn Fritter"
    ],
    "description": "Indonesian cuisine is one of the most vibrant and colorful cuisines in the world, full of intense flavor. It is diverse, in part because Indonesia is composed of approximately 6,000 populated islands of the total 18,000 in the world's largest archipelago, with more than 300 ethnic groups calling Indonesia their home. Many regional cuisines exist, often based upon indigenous culture and foreign influences. Indonesia has around 5,350 traditional recipes, with 30 of them considered the most important.\nIn 2011, Indonesian cuisine began to gain worldwide recognition, with three of its popular dishes make it to the list of 'World's 50 Most Delicious Foods (Readers' Pick)', a worldwide online poll by 35,000 people held by CNN International. Rendang top the list as the number one, followed closely by nasi goreng in number two, and satay in number fourteen.\nIndonesian cuisine varies greatly by region and has many different influences. Sumatran cuisine, for example, often has Middle Eastern and Indian influences, featuring curried meat and vegetables such as gulai and kari, while Javanese cuisine is mostly indigenous, with some hint of Chinese influence. The cuisines of Eastern Indonesia are similar to Polynesian and Melanesian cuisine. Elements of Chinese cuisine can be seen in Indonesian cuisine: foods such as bakmi (noodles), bakso (meat or fish balls), and lumpia (spring rolls) have been completely assimilated.\nAti = Chicken liver\nDaging = Beef\nGoreng = Stir-fried\nKentang = Potatoes\nKerecek = Cattle skin\nLabu Siam = Chayote\nNasi = Rice\nMee = Noodles\nSambal = Chili paste\nUdang = shrimpsEid is known in Indonesia as Hari Raya Idul Fitri, or more popularly as Lebaran, and is a national holiday. People return to their home town or city (an exodus known as mudik) to celebrate with their families and to ask forgiveness from parents, in-laws, and other elders. Festivities start the night before with chanting the Takbir and …People gather with family and neighbors in traditional clothing and have a special Lebaran meal. Children are given money in colorful envelopes. Later, it is common for Muslims in Indonesia to visit the graves of relatives to ritually clean the grave. Muslims also visit the living in a special ritual called Halal bi-Halal sometime during or several days …List of traditional fast food dishes that is sold at food stalls and cookshops in Indonesia.These are the dishes that are commonly eaten during Ramadan in Indonesia."
  },
  { "name": "Cantonese", "country": "China", "dishes": [], "description": "" },
  {
    "name": "South African",
    "country": "South Africa",
    "dishes": [
      "Amasi",
      "Biltong",
      "Bobotie",
      "Boerewors",
      "Braai",
      "Bunny Chow",
      "Cape Malay Chicken Curry",
      "Cape Malay Chicken Curry With Yellow Rice",
      "Castle Lager Beer",
      "Chakalaka",
      "Droëwors",
      "Koeksisters",
      "Malva Pudding",
      "Ostrich Egg Omelette",
      "Pap",
      "Piri Piri Chicken",
      "Potbrood",
      "Rusks",
      "Sheep Head",
      "Umngqusho"
    ],
    "description": "The cuisine of South Africa is sometimes called \"rainbow cuisine\", as it has had a variety of multicultural sources and stages. The cuisine can be generalized as:\n- Cookery practiced by indigenous people of Africa such as the Sotho- and Nguni-speaking people.\n- Cookery that emerged from several waves of colonization and immigration introduced during the colonial period by white European people of Dutch (since 1652), German, French, Italian, Greek and British (since 1805~1820) descent and their Indo-Asian slaves or servants - this includes the cuisine of the so-called Cape Malay people, which has many characteristics of Indonesia and cooking styles from neighboring colonial cultures such as Portuguese Mozambique."
  },
  {
    "name": "Uzbek",
    "country": "Uzbekistan",
    "dishes": [
      "Dimlama",
      "Joshpara",
      "Kuurdak",
      "Laghman",
      "Lagman",
      "Non",
      "Plov",
      "Shelpek"
    ],
    "description": "Uzbek cuisine is influenced by local agriculture, as in most nations. There is a great deal of grain farming in Uzbekistan, so breads and noodles are of importance, and Uzbek cuisine has been characterized as \"noodle-rich\". Mutton is a popular variety of meat due to the abundance of sheep in the country and it is a part of various Uzbek dishes.\nUzbekistan's signature dish is palov (plov or osh or \"pilaf\"), a main course typically made with rice, pieces of meat, grated carrots and onions. It is usually cooked in a kazan (or deghi) over an open fire; chickpeas, raisins, barberries, or fruit may be added for variation. Although often prepared at home for family and guests by the head of household or the housewife, palov is made on special occasions by the oshpaz, or the osh master chef, who cooks the national dish over an open flame, sometimes serving up to 1,000 people from a single cauldron on holidays or occasions such as weddings. Oshi nahor, or \"morning plov\", is served in the early morning (between 6 and 9 am) to large gatherings of guests, typically as part of an ongoing wedding celebration.\nOther notable national dishes include: shurpa (shurva or shorva), a soup made of large pieces of fatty meat (usually mutton) and fresh vegetables; norin and lagman, noodle-based dishes that may be served as a soup or a main course; manti (also called qasqoni), chuchvara, and somsa, stuffed pockets of dough served as an appetizer or a main course; dimlama (a meat and vegetable stew) and various kebabs, usually served as a main course.\nGreen tea is the national hot beverage taken throughout the day; teahouses (chaikhanas) are of cultural importance. The more usual black tea is preferred in Tashkent. Both are typically taken without milk or sugar. Tea always accompanies a meal, but it is also a drink of hospitality, automatically offered green or black to every guest. Ayran, a chilled yogurt drink, is popular in the summer, but does not replace hot tea.\nThe use of alcohol is less widespread than in the west, but wine is comparatively popular for a Muslim nation as Uzbekistan is largely secular. Uzbekistan has 14 wineries, the oldest and most famous being the Khovrenko Winery in Samarkand (est. 1927). The Samarkand Winery produces a range of dessert wines from local grape varieties: Gulyakandoz, Shirin, Aleatiko, and Kabernet likernoe (literally Cabernet dessert wine in Russian). Uzbek wines have received international awards and are exported to Russia and other countries in Central Asia.\nhttps://en.wikipedia.org/wiki/Uzbek_cuisine"
  },
  {
    "name": "Puerto Rican",
    "country": "Puerto Rico",
    "dishes": [
      "Alcapurria",
      "Arroz Con Gandules",
      "Arroz Con Habichuelas",
      "Arroz Con Pollo",
      "Bacalaitos",
      "Bacalao",
      "Bistec Encebollado",
      "Chillo Frito",
      "Chuleta De Cerdo A La Parilla",
      "Coquito",
      "Empanadillas",
      "Filete De Mero",
      "Lechon",
      "Maduros",
      "Mallorca Sandwich",
      "Medalla Light Beer",
      "Mero Con Tostones",
      "Mero Isleno",
      "Mofongo",
      "Mofongo Relleno De Bacalao"
    ],
    "description": "Puerto rican cuisine has its roots in the cooking traditions and practices of europe (spain), africa and the native taínos. in the latter part of the 19th century, the cuisine of puerto rico was greatly influenced by the united states in the ingredients used in its preparation. puerto rican cuisine has transcended the boundaries of the island, and can be found in several countries outside the archipelago.\nhttp://en.wikipedia.org/wiki/puerto_rican_cuisineDelicious food you can find on roadside kiosks and cuchifritos of Puerto Rico.This is a list of traditional dishes from Puerto Rico you must have."
  },
  {
    "name": "Swedish",
    "country": "Sweden",
    "dishes": [
      "Absolut Vodka",
      "Appelkaka",
      "Blåbärssoppa",
      "Blodpalt",
      "Brunkal",
      "Cardamom Bread",
      "Chokladboll",
      "Cinnamon Bun Lussekatter",
      "Citrus Cured Salmon Gravlax",
      "Crisp Bread",
      "Flygande Jakob",
      "Gubbröra",
      "Herring Soup",
      "Inkokt Lax",
      "Ischoklad",
      "Janssons Temptation",
      "Kavring",
      "Kladdkaka",
      "Knäck",
      "Kroppkaka"
    ],
    "description": "These Swedish cuisine could be described as centered around cultured dairy products, crisp and soft (often sugared) breads, berries and stone fruits, beef, chicken, lamb, pork, and seafood. Potatoes are often served as a side dish, often boiled. Swedish cuisine has a huge variety of breads of different shapes and sizes, made of rye, wheat, oat, white, dark, sourdough, and whole grain, and including flatbreads and crispbreads. There are many sweetened bread types and some use spices. Many meat dishes, especially meatballs, are served with lingonberry jam. Fruit soups with high viscosity, like rose hip soup and blueberry soup (blåbärssoppa) served hot or cold, are typical of Swedish cuisine.\nhttps://en.wikipedia.org/wiki/Swedish_cuisineThe highlight of Swedish cuisine is arguably the pastries and desserts. With so much variety, those with a sweet tooth will be in for plenty of treats when they visit Sweden. Here are some Swedish sweets to try when in Sweden!"
  },
  {
    "name": "Haitian",
    "country": "Haiti",
    "dishes": [
      "Diri Ak Djon Djon",
      "Griyo",
      "Oxtail",
      "Poulet Aux Noix",
      "Pwason Fri"
    ],
    "description": "Haitian cuisine consists of cooking traditions and practices from Haiti. While the cuisine is unpretentious and simple, the flavours are of a bold and spicy nature that demonstrate a primary influence of African culinary aesthetic, paired with a very French sophistication with notable derivatives coming from native Taíno and Spanish techniques.\nHaitian cuisine is often lumped together with other regional islands as \"Caribbean cuisine,\" however it maintains an independently unique flavor. It involves the extensive use of herbs, and the liberal use of peppers. A typical dish would probably be a plate of riz collé aux pois (diri kole ak pwa), which is rice with red kidney beans (pinto beans are often used as well) glazed with a marinade as a sauce and topped off with red snapper, tomatoes and onions. It is often called the Riz National, considered to be the national rice of Haiti. The dish can be accompanied by bouillon. Bouillon is a hearty soup consisting of various spices, potatoes, tomatoes, and meats such as goat or beef. Dishes vary by region.\nhttps://en.wikipedia.org/wiki/Haitian_cuisine"
  },
  {
    "name": "Polish",
    "country": "Poland",
    "dishes": [
      "Babka",
      "Bagel",
      "Bialy",
      "Bigos",
      "Borscht",
      "Christmas Wafer",
      "Czernina",
      "Flaki",
      "Gołąbki",
      "Kabanos",
      "Kalduny",
      "Kanapki",
      "Kasha",
      "Kaszanka",
      "Kielbasa",
      "Kopytka",
      "Korovai",
      "Kotlet Schabowy",
      "Krówki",
      "Kutia"
    ],
    "description": "Polish cuisine is a style of cooking and food preparation originating in or widely popular in Poland. Meat is an important part of the Polish diet. Pork is the most popular meat, and the most commonly eaten meat dish is a fried, breaded pork cutlet served with thick sauce. Beef, ham, and sausage are also eaten regularly. The meat stew called bigos is often called the national dish of Poland. Other famous Polish dishes are golabki (cabbage leaves stuffed with ground meat and rice) and golonka (fresh ham served with horse-radish). Poles also like to eat smoked and pickled fish, especially herring.\nMost Polish meals start with one of Poland's many soups. These range from clear broth to thick soup so hearty it could be a meal in itself. The best known is the beet soup called borscht.\nPoles love desserts, especially cakes. Popular cakes include cheesecake, sponge cake, poppy seed cake, and a pound cake called babka. Special cakes are baked for feast days and weddings.\nPopular beverages include coffee, tea, milk, buttermilk, and fruit syrup and water. However, vodka distilled from rye is known as the national drink.These are the street of Poland.vegetarian dishes you find in Poland"
  },
  {
    "name": "Scottish",
    "country": "Scotland",
    "dishes": [
      "Abernethy Biscuit",
      "A Full Scottish",
      "Bacon Butty",
      "Bannocks",
      "Berwick Cockle",
      "Black Bun",
      "Buttery",
      "Caboc",
      "Cock A Leekie Soup",
      "Colcannon",
      "Deep-Fried Mars Bar",
      "Haggis",
      "Irn-bru",
      "Neeps And Tatties",
      "Oat Cake",
      "Oatmeal Raisin Cookie",
      "Rumbledethumps",
      "Scotch",
      "Scotch Collops",
      "Scotch Pie"
    ],
    "description": "Scottish cuisine is the specific set of cooking traditions, practices and cuisines associated with Scotland. It has distinctive attributes and recipes of its own, but shares much with wider British and European cuisine as a result of local and foreign influences, both ancient and modern. Traditional Scottish dishes exist alongside international foodstuffs brought about by migration.\nScotland's natural larder of game, dairy products, fish, fruit, and vegetables is the chief factor in traditional Scots cooking, with a high reliance on simplicity and a lack of spices from abroad, as these were historically rare and expensive.\nhttps://en.wikipedia.org/wiki/Scottish_cuisineScottish people are very serious for health. Always they are very conscious for food. They think about colour, flavor, taste, fresh, smell. They have many traditional dishes you should try.Scotland has a wide range of different food. Most foods contain meat, beans, cheese, etc. Below is a list of the most traditional and popular dishes you must try from Scottish cuisine.These are the comfort dishes loved in Scotland.These are the comfort dishes loved in Scotland."
  },
  {
    "name": "Italian",
    "country": "Italy",
    "dishes": [
      "Acquacotta",
      "Acqua Pazza",
      "Aioli",
      "Amaretti Di Saronno",
      "Antipasto",
      "Arancini",
      "Arrabbiata Sauce",
      "Bellini",
      "Berlingozzo",
      "Bigoli",
      "Biscotti",
      "Biscuit Tortoni",
      "Black Ink Pasta",
      "Bolognese Sauce",
      "Bombolonas",
      "Borlengo",
      "Breadstick",
      "Bruschetta",
      "Bruttiboni",
      "Buridda"
    ],
    "description": "Italian cuisine has developed through centuries of social and political changes, with roots as far back as antiquity.\nSignificant changes occurred with the discovery of the New World and the introduction of potatoes, tomatoes, bell peppers and maize, now central to the cuisine but not introduced in quantity until the 18th century. Italian cuisine is noted for its regional diversity, abundance of difference in taste, and it is probably the most popular in the world, with influences abroad.\nItalian cuisine is characterized by its simplicity, with many dishes having only four to eight ingredients. Italian cooks rely chiefly on the quality of the ingredients rather than on elaborate preparation. Ingredients and dishes vary by region. Many dishes that were once regional, however, have proliferated with variations throughout the country.\nCheese and wine are a major part of the cuisine, with many variations and Denominazione di origine controllata (DOC) (regulated appellation) laws. Coffee, specifically espresso, has become important in Italian cuisine.\nhttp://en.wikipedia.org/wiki/Italian_cuisineList of traditional food served in or near Christmas in ItalyList of traditional comfort food dishes in Italy.Paella is one of the most representative dishes from Spanish gastronomy or one of the most well know. There are many types of paellas but the most traditional could be...Vegetarian food you find in ItalyIt’s hard to speak about Italian food, it’s better to enjoy it. The traditional colors of Italian cuisine – red, green and yellow always create a great mixture of flavor and taste. Usually, all the dishes are based on tomato, bread and olive oil. The secret of the cuisine is not in a sophisticated preparation process, it is …"
  },
  {
    "name": "Russian",
    "country": "Russia",
    "dishes": [
      "Aspic",
      "Baked Apple",
      "Baltika 6",
      "Beef Stroganoff",
      "Blachinda",
      "Black Russian Cocktail",
      "Bliny",
      "Borodinsky Bread",
      "Borscht",
      "Cantiq",
      "Caviar",
      "Chak Chak",
      "Chebureki",
      "Chicken Kiev",
      "Chislic",
      "Chocolate Salami",
      "Churchkhela",
      "Citrus Cured Salmon Gravlax",
      "Coulibiac",
      "Curd Snack"
    ],
    "description": "Russian cuisine is a collection of the different cooking traditions of the Russian people. The cuisine is diverse, as Russia is by area the largest country in the world. Russian cuisine derives its varied character from the vast and multi-cultural expanse of Russia. Moreover, it is necessary to divide Russian traditional cuisine and Soviet cuisine, which has its own peculiarity. Its foundations were laid by the peasant food of the rural population in an often harsh climate, with a combination of plentiful fish, pork, poultry, caviar, mushrooms, berries, and honey. Crops of rye, wheat, barley and millet provided the ingredients for a plethora of breads, pancakes, pies, cereals, beer and vodka. Soups and stews full of flavor are centered on seasonal or storable produce, fish and meats. This wholly native food remained the staple for the vast majority of Russians well into the 20th century.\nRussia's great expansions of culture, influence, and interest during the 16th–18th centuries brought more refined foods and culinary techniques, as well as one of the most refined food countries in the world. It was during this period that smoked meats and fish, pastry cooking, salads and green vegetables, chocolate, ice cream, wines, and juice were imported from abroad. At least for the urban aristocracy and provincial gentry, this opened the doors for the creative integration of these new foodstuffs with traditional Russian dishes. The result is extremely varied in technique, seasoning, and combination. https://en.wikipedia.org/wiki/Russian_cuisineThe cuisine of the Volga Tatars takes its origin from the cuisine of the Volga Bulgars, who once were nomads, but nearly 1500 years ago turned to agriculture and assimilated into local agricultural societies. Tatar cuisine was influenced by the surrounding peoples – Russians, Mari, Udmurts, and also peoples of Central Asia, especially Uzbeks. Dishes such as pilaw …The major activity of the Bashkir people was the seminomadic cattle breeding, and tribes followed the horse herds and sheep. This way of living provided the people with original culture, traditions, customs and peculiar national cuisine. The combination of meat and milk products with grain and flour products became the basics of Bashkir people’s cuisine. They also used …These delicacies are eaten during Christmas in Russia.List of the most popular Russian desserts. If you've got a sweet tooth, these are the sweet dishes you have to try in Russia."
  },
  {
    "name": "Georgian",
    "country": "Georgia",
    "dishes": [
      "Achma",
      "Adjarian Khachapuri",
      "Adjika",
      "Ajapsandali",
      "Ajika",
      "Badrijani",
      "Baklava",
      "Bazhe",
      "Chakapuli",
      "Chakhokhbili",
      "Chanakhi",
      "Chashushuli",
      "Chicken Tabaka",
      "Chikhirtma",
      "Elarji",
      "Georgian Solyanka",
      "Ghomi",
      "Gozinaki",
      "Imeruli Khachapuri",
      "Jonjoli"
    ],
    "description": "Georgian cuisine (Georgian: ქართული სამზარეულო; k’art’uli samzareulo) refers to the cooking styles and dishes that originate in the country of Georgia (along with two breakaway independent states of Abkhazia and South Ossetia) and which are historically prepared by Georgian people around the world. The Georgian cuisine is unique to the country, but also carries some influences from other European and nearby Middle Eastern culinary traditions. Each historical province of Georgia has its own distinct culinary tradition, with variations such as Megrelian, Kakhetian, and Imeretian cuisines. Heavy on meat dishes, the Georgian cuisine also offers a variety of vegetarian dishes.\nGeorgian cuisine is the result of the rich interplay of culinary ideas carried along the trade routes by merchants and travelers alike. The importance of both food and drink to Georgian culture is best observed during a feast called supra, when a huge assortment of dishes are prepared, always accompanied by large amounts of wine, and that can last for hours. In a Georgian feast, the role of the tamada (toastmaster) is an important and honoured position.\nGeorgian restaurants were prevalent in Russia throughout the 20th century, influenced in part by Joseph Stalin's Georgian ethnicity. In Russia, all major cities have many Georgian restaurants, and Russian restaurants often feature Georgian food items on their menu.\nIn countries of the former Soviet Union, Georgian food is also popular due to the immigration of Georgians to other Soviet republicsThis 10 Will Make You Fall in Love With Georgian FoodThere are many delicious dishes in Georgian cuisine. Here is the list of Georgian foods that are popular in the country."
  },
  {
    "name": "Japanese",
    "country": "Japan",
    "dishes": [
      "Agedashi Tofu",
      "Ama Ebi Nigiri Sushi",
      "Amanatto",
      "Amezaiku",
      "Ankimo",
      "Anko",
      "Anmitsu",
      "Annin Tofu",
      "Anpan",
      "Asahi Super Dry Beer",
      "Bandeimochi",
      "Bento Box",
      "Boston Roll Sushi",
      "Botamochi",
      "Bubble Tea Roll",
      "California Roll Sushi",
      "Camaron Rebosado",
      "Castella",
      "Champon",
      "Chankonabe"
    ],
    "description": "The traditional food of Japan is based on rice with miso soup and other dishes, with an emphasis on seasonal ingredients. The side dishes often consist of fish, pickled vegetables, and vegetables cooked in broth. Fish is common in the traditional cuisine. It is often grilled, but it may also be served raw as sashimi or in sushi. Seafood and vegetables are also deep-fried in a light batter as tempura.\nApart from rice, staples include noodles, such as soba and udon. Japan has many simmered dishes such as fish products in broth called oden, or beef in sukiyaki and nikujaga. Foreign food, in particular Chinese food in the form of noodles in soup called ramen and fried dumplings, gyoza, and western food such as curry and hamburger steaks are commonly found in Japan. Historically, the Japanese shunned meat, but with the modernization of Japan in the 1860s, meat-based dishes such as tonkatsu became common.\nJapan has an indigenous form of sweets called wagashi, which include ingredients such as red bean paste, as well as its indigenous rice wine sake.\nJapanese cuisine, particularly sushi, has now become popular throughout the world. (http://en.wikipedia.org/wiki/Japanese_cuisine)\nDonburi, Don = Rice bowl dish\nKare, kare, Kari = Curry\nkatsu = deep-fried cutlet of meatList of traditional fast food dishes that is sold at food stalls and cookshops in Japan.Japanese food is one of a kind. You will never mistake it. Sushi, sashimi, unagi, and sake… we all know this. But this cuisine is not only about products and recipes, here a lot is about their indigenous culture and traditions. It is not surprising then that they made the whole world eat with chopsticks instead of knives …The Japanese celebrate the New Year Day with traditional New Year foods called Osechi Ryori (御節料理) These are the most popular dishes."
  },
  {
    "name": "Indian",
    "country": "India",
    "dishes": [
      "Aam Panna",
      "Aam Papad",
      "Aamras",
      "Achari Arbi",
      "Achari Chicken",
      "Achari Murgh",
      "Akki Rotti",
      "Allam Kodi",
      "Almond And Amaranth Laddu",
      "Aloo Bhindi",
      "Aloo Cabbage",
      "Aloo Curry",
      "Aloo Gobhi",
      "Aloo Gosht",
      "Aloo Ka Halwa",
      "Aloo Ki Tikki",
      "Aloo Mutter",
      "Aloo Paratha",
      "Aloo Tikki Chaat",
      "Andhra Chicken Curry"
    ],
    "description": "Indian cuisine encompasses a wide variety of regional cuisines native to india. given the range of diversity in soil type, climate and occupations, these cuisines vary significantly from each other and use locally available spices, herbs, vegetables and fruits. indian food is also heavily influenced by religious and cultural choices and traditions.\nthe development of these cuisines have been shaped by dharmic beliefs, and in particular by vegetarianism, which is a growing dietary trend in indian society. there has also been central asian influence on north indian cuisine from the years of mughal rule. indian cuisine has been and is still evolving, as a result of the nation's cultural interactions with other societies.\nhttp://en.wikipedia.org/wiki/indian_cuisine\nAloo = Potato\nAṇḍā,अंडा = Egg\nChana = chickpeas\nDal = Lentil\nḌēyarī, डेयरी = Dairy\nGobi = cauliflower\nGosht = Meat\nHanī, हनी = Honey\nJal = water\nJeera = cumin\nkeema, qeema = Minced meat\nMasala = Mixture of spices ground into a paste or powder\nManasā = Meat, मनसा\nMattar-Rudhrapur = Green Peas\nPalak = Spinach\nPaneer, Panīra, पनीर = Paneer cheese, fresh cheese\nPōlṭrī, पोल्ट्री = Poultry\nRajma = red kidney beans\nSaag = Spinach\nSamudrī bhōjana = Seafood, समुद्री भोजन\nTikki = cutlet or croquette\nUrad = black lentilList of traditional vegetarian fast food dishes that are sold at food stalls and cookshops in the streets of India.This is a list of Indian dishes. Indian cuisine encompasses a wide variety of regional cuisines native to India. Given the range of diversity in soil type, climate and occupations, these cuisines vary significantly from each other and use locally available spices, herbs, vegetables, and fruits. The dishes are then served according to taste in either mild, medium …Mithais, or sweet treats, are an integral part of Indian cuisine. While they’re enjoyed during a hearty meal, sweets and desserts are also central to Indian festivals. Some of these, like laddu, originated in ancient India, but many of them were introduced to the country by the Mughal rulers who came from Persia. Here are some of the …"
  },
  {
    "name": "Argentine",
    "country": "Argentina",
    "dishes": [
      "Alfajor",
      "Argentina vs Nigeria",
      "Asado",
      "Baked Quinoa Empanadas",
      "Berenjena En Escabeche",
      "Chimichurri",
      "Chipa",
      "Chipa Guazu",
      "Chipa So'o",
      "Chocotorta",
      "Choripan",
      "Choripan Con Chimichurri",
      "Cynar Julep Cocktail",
      "Deviled Egg",
      "Dulce De Batata",
      "Dulce De Leche",
      "Empanadas De Carne De Res",
      "Empanadas Saltenas",
      "Fernet",
      "Fernet Con Coca"
    ],
    "description": "Argentine cuisine may be described as a cultural blending of Indigenous, Mediterranean influences (such as those created by Italian and Spanish populations) within the wide scope of livestock and agricultural products that are abundant in the country 'Argentine Gastronomy'.\nArgentine annual consumption of beef has averaged 100 kg (220 lbs) per capita, approaching 180 kg (396 lbs) per capita during the 19th century; consumption averaged 67.7 kg (149 lbs) in 2007. Beyond asado (the Argentine barbecue), no other dish more genuinely matches the national identity. Nevertheless, the country's vast area, and its cultural diversity, have led to a local cuisine of various dishes.\nThe great immigratory waves consequently imprinted a large influence in the Argentine cuisine, after all Argentina was the second country in the world with the most immigrants with 6.6 million, only second to the United States with 27 million, and ahead of other immigratory receptor countries such as Canada, Brazil, Australia, etc. https://en.wikipedia.org/wiki/Argentine_cuisineList of traditional fast food dishes that are sold at food stalls and cookshops in the streets of Argentina."
  },
  {
    "name": "Swiss",
    "country": "Sweden",
    "dishes": [
      "Alplermagronen",
      "Basler Lackerli",
      "Berner Haselnusslebkuchen",
      "Birnbrot",
      "Bundner Nusstorte",
      "Bürli",
      "Carac",
      "Christmas Ham",
      "Cordon Bleu",
      "Fondue",
      "Goulash",
      "Gruyère Cheese",
      "Gugelhupf",
      "Hefekranz",
      "King Cake",
      "Landjäger",
      "Malakoff",
      "Müesli",
      "Pane Ticinese",
      "Papet Vaudois"
    ],
    "description": "The cuisine of Switzerland combines influences from the German, French and North Italian cuisine. However, it varies greatly from region to region with the language divisions constituting a rough boundary outline. Mind you, many dishes have crossed the local borders and become firm favourites throughout Switzerland.These are the Christmas dishes eaten in Switzerland.Whenever you visit Switzerland, you should try these dishes.These are the dishes you should try when you visit Sweden.Vegetarian dishes you find in Switzerland"
  },
  {
    "name": "Hawaiian",
    "country": "United States of America",
    "dishes": [
      "Haupia",
      "Hawaiian Fried Rice",
      "Hawaiian Haystack",
      "Huli Huli Chicken",
      "Kalua Pork",
      "Kulolo",
      "Laulau",
      "Loco Moco",
      "Lomi-lomi Salmon",
      "Macaroni Salad",
      "Okinawan Haupia Pie",
      "Poke",
      "Shave Ice",
      "Spam Musubi"
    ],
    "description": "The cuisine of Hawaii incorporates five distinct styles of food reflecting the diverse food history of settlement and immigration in the Hawaiian Islands. In the pre-contact period of Ancient Hawaii (300 AD–1778), Polynesian voyagers brought plants and animals to the Islands. As Native Hawaiians settled the area, they fished, raised taro for poi, planted coconuts, sugarcane, sweet potatoes and yams, and cooked meat and fish in earth ovens. After first contact in 1778, European and American cuisine arrived along with missionaries and whalers, who introduced their own foods and built large sugarcane plantations. Christian missionaries brought New England cuisine while whalers introduced salted fish which eventually transformed into the side dish lomilomi salmon.We're heading to Hawaii for this week's Destination Dinner for Two, available for carryout/delivery July 10-14. You'll enjoy huli huli grilled chicken, classic smoked kalua pork butt, chilled macaroni salad, Hawaiian fried rice, an optional ahi tuna poke and Okinawan haupia pie for dessert. Also included in each package is a bottle of wine or a cocktail jar …"
  },
  {
    "name": "Lebanese",
    "country": "Lebanon",
    "dishes": [
      "Balila",
      "Batata Harra",
      "Beef Shawarma",
      "Burghul Banadoura",
      "Chicken Kabob",
      "Daoud Bacha",
      "Esfiha",
      "Falafel",
      "Fatte Bel Lahm",
      "Fattet Makdous",
      "Fattoush",
      "Fried Cauliflower",
      "Ful Medames",
      "Kebbah",
      "Keshk",
      "Kibbeh Nayyeh",
      "Kibe",
      "Kofta",
      "Labneh",
      "Lahmacun"
    ],
    "description": "Food from Lebanon\nLebanese cuisine includes an abundance of starches, whole grain, fruits, vegetables, fresh fish and seafood; animal fats are consumed sparingly. Poultry is eaten more often than red meat. When red meat is eaten it is usually lamb on the coast, and goat meat in the mountain regions. It also includes copious amounts of garlic and olive oil, often seasoned by lemon juice.; olive oil, herbs, garlic and lemon are typical flavors found in the Lebanese diet.\nhttps://en.wikipedia.org/wiki/Lebanese_cuisine\nCommon words:\nMezza = appetizer"
  },
  {
    "name": "Malaysian",
    "country": "Malaysia",
    "dishes": [
      "Acar Awak",
      "Ais Kacang",
      "Ambuyat",
      "Apam Balik",
      "Asam Laksa",
      "Asam Pedas",
      "Ayam Pansuh",
      "Ayam Pelalah",
      "Bahulu",
      "Bak Kut Teh",
      "Bandung",
      "Banmian",
      "Bao Bing",
      "Batik Cake",
      "Bean Sprouts Chicken",
      "Beef Rendang",
      "Black Glutinous Rice Porridge",
      "Black Sesame Tong Yuen",
      "Bubur Cha Cha",
      "Budu"
    ],
    "description": "Malaysian cuisine consists of cooking traditions and practices found in Malaysia, and reflects the multiethnic makeup of its population. The vast majority of Malaysia's population can roughly be divided among three major ethnic groups: Malays, Chinese and Indians. The remainder consists of the indigenous peoples of Sabah and Sarawak in East Malaysia, the Orang Asli of Peninsular Malaysia, the Peranakan and Eurasian creole communities, as well as a significant number of foreign workers and expatriates.\nAs a result of historical migrations, colonisation by foreign powers, and its geographical position within its wider home region, Malaysia's culinary style in the present day is primarily a melange of traditions from its Malay, Chinese, Indian, Indonesian and ethnic Bornean citizens, with heavy to light influences from Thai, Portuguese, Dutch, and British cuisines, to name a few. This resulted in a symphony of flavours, making Malaysian cuisine highly complex and diverse.\nBecause Peninsular Malaysia shares a common history with Singapore, it is common to find versions of the same dish across both sides of the border regardless of place of origin, such as laksa and chicken rice. Also because of their proximity, historic migrations and close ethnic and cultural kinship, Malaysia shares culinary ties with Indonesia, as both nations often share certain dishes, such as satay, rendang and sambal.\nhttps://en.wikipedia.org/wiki/Malaysian_cuisine\nNasi = Rice\nHar = Prawns\nMee = Hokkien = noodles\nRoti = Bread"
  },
  {
    "name": "Belgian",
    "country": "Belgium",
    "dishes": [
      "Apple Butter",
      "Apple Fritters",
      "Belgian Beer",
      "Belgian Beer Sangria",
      "Belgian Rice Pie",
      "Boterhammen Tartines",
      "Carbonade Flamande",
      "Couque De Dinant",
      "Cramique",
      "Croquetas De Camarones",
      "Curry Ketchup",
      "Delirium Tremens Beer",
      "Flemish Beef Stew",
      "Geraardsbergse Mattentaart",
      "Goulash",
      "Gray Shrimp Croquettes",
      "La Dame Blanche",
      "Leffe Brune Brown Beer",
      "Liégeoise Salad",
      "Liers Vlaaike"
    ],
    "description": "Belgian cuisine is widely varied with significant regional variations while also reflecting the cuisines of neighbouring France, Germany and the Netherlands. It is sometimes said that Belgian food is served in the quantity of German cuisine but with the quality of French food. Outside the country, Belgium is best known for its chocolate, waffles, fries and beer.\nThough Belgium has many distinctive national dishes, many internationally popular foods like hamburgers and spaghetti bolognese are also popular in Belgium, and most of what Belgians eat is also eaten in neighbouring countries. 'Belgian cuisine' therefore usually refers to dishes of Belgian origin, or those considered typically Belgian.\nBelgian cuisine traditionally prizes regional and seasonal ingredients. Ingredients typical in Belgian dishes include potatoes, leeks, grey shrimp, white asparagus, Belgian endives and local beer, in addition to common European staples including meat, cheese and butter. Belgians typically eat three meals a day, with a light breakfast, medium or large-sized lunch and small dinner.\nBelgium has a plethora of dishes and products that are local to a specific area. Examples include waterzooi from Ghent, the couque biscuit from the town of Dinant, and tarte au riz from Verviers. While their local origins are acknowledged, most such dishes are enjoyed throughout Belgium.List of vegetarian Dishes From Belgian CuisineBelgian cuisine has a wide range of delicious desserts that you must try."
  },
  {
    "name": "California",
    "country": "California",
    "dishes": [
      "Mission Burrito",
      "Tetrazzini",
      "Uramaki",
      "Cobb Salad",
      "French Dip Sandwich",
      "Fortune Cookie",
      "Ranch Dressing",
      "Avacado Toast",
      "Burrito",
      "Cheeseburger"
    ],
    "description": "California Cuisine shows the ethnical diversity of the people who make up this state. Its a mix of fresh ingredients, vegetables, fresh cheeses, grilled meat, fish and seafood, nuts, an assortment of cross-cultural dishes influenced by other international cuisines: Mexican, Chinese, European."
  },
  {
    "name": "Tibetan",
    "country": "Tibet",
    "dishes": [
      "Momo",
      "Sha Phaley",
      "Laping",
      "Balep Korkun"
    ],
    "description": "Tibetan cuisine includes the culinary traditions and practices of Tibet and its peoples, many of whom reside in India and Nepal. It reflects the Tibetan landscape of mountains and plateaus and includes influences from neighbors (including other countries India and Nepal). It is known for its use of noodles, goat, yak, mutton, dumplings, cheese (often from yak or goat milk), butter (also from animals adapted to the Tibetan climate) and soups. Grain, traditionally mostly barley, is the staple food of Tibetans. Meat and dairy products are an indispensable addition. Rice is only cultivated in the lower regions situated in the south of Tibet and is imported mainly. Vegetables and fruits were eaten rarely in Central Tibet until quite recently, because their cultivation was very difficult. Nowadays it is possible to grow these crops due to the construction of greenhouses. Following the different vegetative conditions, the Tibetan cuisine has a big variety."
  },
  {
    "name": "Southern",
    "country": "United States of America",
    "dishes": [
      "Sausage Gravy",
      "Biscuits And Sausage Gravy",
      "American Goulash",
      "Arizona Cheese Crisp",
      "Baked Beans",
      "Barbecue Chicken",
      "Biscuit",
      "Brunswick Stew",
      "Cactus Fries",
      "Chicken Chimis",
      "Chicken Fried Steak"
    ],
    "description": "The cuisine of the Southern United States is the historical regional culinary form of states generally south of the MasonDixon line dividing Pennsylvania and Delaware from Maryland as well as along the Ohio River, and extending west to southern Missouri, Oklahoma and Texas. The most notable influences come from African, English, Scottish, Irish, German, French, and Native American cuisines. Tidewater, Appalachian ,Creole, Lowcountry, and Floribbean are examples of types Southern cuisine. In recent history, elements of Southern cuisine have spread north, having an effect on the development of other types of American cuisine. Many items such as squash, tomatoes, corn (and its derivatives, including grits), as well as the practice of deep pit barbecuing were inherited from the southeastern American Indian tribes such as the Caddo, Choctaw, and Seminole. Many foods associated with sugar, flour, milk, eggs (many kinds of baking or dairy products such as breads and cheeses) are more associated with Europe. Black-eyed peas, okra, rice, eggplant, benne (sesame) seed, sorghum, and melons, as well as the spices can be attributed to peoples of African origin."
  },
  {
    "name": "Caribbean",
    "country": "",
    "dishes": [
      "Asham",
      "Bahama Mama",
      "Belize",
      "Callaloo",
      "Cornmeal Pudding",
      "Crab and Calaloo",
      "Curry Chicken",
      "Goat Water",
      "Jamaican Blue Draws",
      "Martinique",
      "Oil Down"
    ],
    "description": "Caribbean cuisine is a fusion of African, Creole, Cajun, Amerindian, European, Latin American, Indian/South Asian, Middle Eastern, and Chinese. These traditions were brought from many different countries when they came to the Caribbean. In addition, the population has created styles that are unique to the region."
  }
  
]
