{"status":"ok","total_hits":10000,"page":1,"total_pages":2000,"page_size":5,"articles":[{"summary":"Braised shrimp and sausage stuffed pork chops By Chef John Folse | March 2, 2021 at 10:56 AM CST - Updated March 2 at 10:56 AM BATON ROUGE, La. (WAFB) - Most people stuff center-cut pork chops with rice or cornbread stuffing. Often, even boudin can be found in these dishes. My favorite stuffing is to buy a garlic or green onion fresh sausage and blend it with shrimp, crawfish or crab–whatever's in season. I then braise it in a black skillet. Wow, what a dish! 4 (1¼–1½ inch thick) center-cut pork loin chops 4 (6-inch) links fresh, green onion pork sausage 1 cup (60–70 count) shrimp, peeled and deveined salt and cracked black pepper to taste granulated garlic to taste ¼ cup minced red bell pepper ¼ cup minced yellow bell pepper ¼ cup sliced green onions ¼ cup Italian bread crumbs Have your butcher cut a pocket into center of chop, where stuffing will eventually be placed.","country":"US","clean_url":"wafb.com","author":null,"rights":"wafb.com","link":"https://www.wafb.com/2021/03/02/braised-shrimp-sausage-stuffed-pork-chops/","rank":"11900","topic":"news","language":"en","title":"Braised shrimp and sausage stuffed pork chops","published_date":"2021-03-02 17:01:43","_id":"dd5c64447495d53d3ead1d82cb39f454","_score":37.33172},{"summary":"6 Servings Tuna American main dish, side dish, bake, kid friendly, american, tuna, dinner, summer, fresh, collxseafood, collsxnrm, collsxpasta, collsxmakeahead, collsxcomfort, white-meat-free, nut-free, contains-cheese, contains-gluten, red-meat-free, contains-fish, shellfish-free, contains-pasta, contains-dairy, pescatarian Pasta Tuna fish Sour cream milk Salt Black pepper Bread crumbs Parmesan cheese Butter * Cook pasta noodles, then mix all ingredients (except bread crumbs and parmesan cheese) into a casserole dish.","country":"NA","clean_url":"bigoven.com","author":null,"rights":"bigoven.com","link":"https://www.bigoven.com/recipe/tuna-noodle-casserole/162077","rank":"26376","topic":"NA","language":"en","title":"Tuna Noodle Casserole","published_date":"2021-03-01 00:04:30","_id":"7c24f65282f31a3346a0e0a927389405","_score":29.940477},{"summary":"One of the most important customs of Purim, the Jewish holiday that begins at sundown Thursday and lasts through sundown Friday, is the giving of food. The practice, called mishloach manot in Hebrew, entails sending at least two ready-to-eat foods to the elderly and the poor, friends and family. Whatever else is in the package, hamantaschen, the Eastern European symbolic, triangle-shaped, filled Purim pastries are a must.Traditionally, hamantaschen are filled with poppy seeds or preserves made from dried fruits such as prunes or apricots.","country":"US","clean_url":"latimes.com","author":"https://www.latimes.com/people/julie-giuffrida","rights":"latimes.com","link":"https://www.latimes.com/recipe/list/send-sweet-treats-for-purim","rank":"180","topic":"food","language":"en","title":"Purim is coming: Send Food!","published_date":"2021-02-23 14:00:16","_id":"45b4393eae25f7180946a4bac8232bf2","_score":29.22122},{"summary":"Purim is one of the happiest of Jewish holidays. It celebrates the survival of the Jews in Ancient Persia when they were set for slaughter at the hands of the king's advisor, Haman. The Book of Esther, or the Megillah, tells how Haman hated the Jews because Mordecai would not bow down to him so he convinced the king that the Jews were a threat that needed to be eliminated. Mordecai's cousin, Esther, became the queen and used the king's love for her to save her people from Haman's plot. On Purim, we celebrate with parades, costumes, food gifts, festive meals, and the giving of charity.","country":"NA","clean_url":"onegreenplanet.org","author":"One Green Planet","rights":"onegreenplanet.org","link":"https://www.onegreenplanet.org/vegan-food/recipes-for-purim-feast/","rank":"6079","topic":"NA","language":"en","title":"10 Traditional Recipes For Your Purim Feast Made Vegan","published_date":"2021-02-26 13:50:06","_id":"4b493aef628ef3aa0433bbd600c6f156","_score":27.56167},{"summary":"Purim is the Jewish holiday that celebrates the survival of the Jews in ancient Persia. We read the biblical Book of Esther, or the Megillah, which tells the story of how Esther saved the Jews from annihilation at the hands of the wicked Haman, an advisor to the king. Haman hated the Jews because Mordecai, Esther's cousin, would not bow down to him. So Haman plotted to destroy the Jewish people by convincing the king that these people followed their own laws rather than the king's and were therefore, a great threat.","country":"NA","clean_url":"onegreenplanet.org","author":"Rhea Parsons","rights":"onegreenplanet.org","link":"https://www.onegreenplanet.org/vegan-food/how-to-celebrate-purim-vegan-style/","rank":"6095","topic":"NA","language":"en","title":"How to Celebrate Purim Vegan-Style","published_date":"2021-02-25 13:40:58","_id":"2fbd9916f014eefa4df2ec62570f5cbc","_score":27.51344}],"user_input":{"q":"Braised Turnips with Poppy-Seed Bread Crumbs","search_in":"title_summary","lang":null,"country":null,"from":"2021-02-23 00:00:00","to":null,"ranked_only":"True","from_rank":null,"to_rank":null,"sort_by":"relevancy","page":1,"size":5,"sources":null,"not_sources":null,"topic":null,"media":"False"}}
