{"status":"ok","total_hits":10000,"page":1,"total_pages":2000,"page_size":5,"articles":[{"summary":"Purim is the Jewish holiday that celebrates the survival of the Jews in ancient Persia. We read the biblical Book of Esther, or the Megillah, which tells the story of how Esther saved the Jews from annihilation at the hands of the wicked Haman, an advisor to the king. Haman hated the Jews because Mordecai, Esther's cousin, would not bow down to him. So Haman plotted to destroy the Jewish people by convincing the king that these people followed their own laws rather than the king's and were therefore, a great threat.","country":"NA","clean_url":"onegreenplanet.org","author":"Rhea Parsons","rights":"onegreenplanet.org","link":"https://www.onegreenplanet.org/vegan-food/how-to-celebrate-purim-vegan-style/","rank":"6095","topic":"NA","language":"en","title":"How to Celebrate Purim Vegan-Style","published_date":"2021-02-25 13:40:58","_id":"2fbd9916f014eefa4df2ec62570f5cbc","_score":38.155273},{"summary":"by: Adam Belson Posted: Feb 23, 2021 / 03:20 PM EST / Updated: Feb 23, 2021 / 03:20 PM EST (Mass Appeal) – Looking for a way to celebrate Chinese New Year? Our 'diva of deliciousness' Tinky Weisblat sent us her easy recipe for Chinese New Year dumplings. Servings: Makes about 24 dumplingsDifficulty Level: ModeratePreparation Time: 15 minutesCook Time (minutes): about 5 minutes per batch of dumplings Ingredients: For the filling:1/2 pound ground pork (or ground chicken if you don't eat pork!)1 egg, beaten1/2 cup finely chopped cabbage (preferably Chinese cabbage, but any cabbage will do in a pinch)2 scallions (white part only), chopped1 tablespoon grated carrot1 clove garlic, minced1 small finger ginger, minced1 teaspoon toasted sesame oil1 pinch sugar1 teaspoon soy sauce or tamari1/2 teaspoon cornstarch For the dipping sauce:3 tablespoons soy sauce or tamari2 tablespoons rice vinegar1 teaspoon sesame oil or toasted sesame oil1 teaspoon chili oil1 clove garlic, minced1/4 teaspoon minced ginger1 scallion, chopped (white plus some green) For assembly:24 wonton or dumpling wrappers (more or less, depending on how big they are)1 egg1 tablespoon watercanola or peanut oil as needed for frying Cooking Directions: Combine the ingredients for the filling.","country":"US","clean_url":"wwlp.com","author":"Adam Belson","rights":"wwlp.com","link":"https://www.wwlp.com/massappeal/delicious-dumplings-to-celebrate-chinese-new-year/","rank":"12363","topic":"news","language":"en","title":"Delicious dumplings to celebrate Chinese New Year","published_date":"2021-02-23 20:20:53","_id":"3b518eccd8af366bf207c3b54576f99b","_score":33.043785},{"summary":"The owner of Walnut Creek's 54 Mint Forno Italiano has brought a culinary first to the Bay Area. And we're sort of losing our minds because there are mozzarella-filled risotto croquettes involved. Casa Barotti is a spizzicheria, which co-owner Daniele Carsano defines on the eatery's website as 'a casual place to pop in and enjoy something delicious with a glass of wine or beer.' It's an homage to the regionally-focused street food spots that are found all over Italy, including in Torino, where Carsano grew up with his two co-owners.","country":"US","clean_url":"mercurynews.com","author":"Jessica Yadegaran","rights":"mercurynews.com","link":"https://www.mercurynews.com/2021/02/26/italian-food-bay-areas-first-spizzicheria-opens-in-berkeley-2","rank":"7151","topic":"news","language":"en","title":"Italian food: Bay Area's first spizzicheria opens in Berkeley","published_date":"2021-02-26 17:00:09","_id":"a093fbf86d0dcef7baa7176017c54044","_score":32.083572},{"summary":"The flavour of the olives infuses the tomato sauce during the low and slow cook, and yet this dish still feels light enough to serve with some simple greens or grains in summer, or in front of a fire with fresh, thick-cut fettuccine and a glass of red in winter. Regardless of the season, there are a few key things to note. Try to find young, fresh leaves of kale if you can; they are less bitter and you don't have to worry about removing the stems before you chop. Secondly, visit a butcher for your meat – I always ask for my chicken to be freshly minced.","country":"GB","clean_url":"telegraph.co.uk","author":"Katrina Meynink","rights":"telegraph.co.uk","link":"https://www.telegraph.co.uk/recipes/0/slow-cooker-chicken-feta-kale-dumplings-sicilian-olives-recipe/","rank":"118","topic":"news","language":"en","title":"Slow cooker chicken, feta and kale dumplings with Sicilian olives recipe","published_date":"2021-02-27 06:00:00","_id":"75c7d3566d0d419ed23294cf886a6edb","_score":31.805618},{"summary":"Oh Golly Dumpling owners Sara Timmer and Ryan Van Splinter. Photo by Chandler Kim Eat and DrinkSara Timmer and Ryan Van Splinter make as many as 1,000 dumplings by hand for each Oh Golly pop-up event. Patricia Kaowthumrong •  February 25, 2021 Sara Timmer and Ryan Van Splinter, the owners of Oh Golly Dumplings, have a talent for injecting humor into everyday life. Case in point: The name of their 10-month-old business comes from one of the many phrases the husband-and-wife team uses around the house in place of profanity.","country":"US","clean_url":"5280.com","author":null,"rights":"5280.com","link":"https://www.5280.com/2021/02/meet-the-good-humored-husband-and-wife-team-behind-oh-golly-dumplings/","rank":"19204","topic":"news","language":"en","title":"Meet the Husband-and-Wife Team Behind Oh Golly Dumplings","published_date":"2021-02-25 15:00:58","_id":"cc5ab0870712cd5a223c631db9c7b9e5","_score":31.148394}],"user_input":{"q":"Chickpea Dumplings in Curried Tomato Sauce","search_in":"title_summary","lang":null,"country":null,"from":"2021-02-23 00:00:00","to":null,"ranked_only":"True","from_rank":null,"to_rank":null,"sort_by":"relevancy","page":1,"size":5,"sources":null,"not_sources":null,"topic":null,"media":"False"}}
