{"status":"ok","total_hits":10000,"page":1,"total_pages":2000,"page_size":5,"articles":[{"summary":"Williams Sonoma If you buy through our links, we may earn money from affiliate partners. Learn more.Earlier during the pandemic, people were baking bread in record numbers, resulting in flour flying off the shelves and yeast nowhere to be found. Unfortunately, many bakeries are still closed or running on limited hours, and many folks are still avoiding crowded grocery stores. Luckily, there are plenty of online bakeries and specialty food stores that are shipping fresh bread nationwide. From stores that are making specialty artisanal loaves and New York bagels to ones selling good old Wonder Bread, here's a running list of where to order bread online.","country":"US","clean_url":"businessinsider.com","author":"Jen Gushue","rights":"businessinsider.com","link":"https://www.businessinsider.com/buy-bread-online","rank":"109","topic":"world","language":"en","title":"The best bread delivery services, from NYC's bagel shops to online grocery stores","published_date":"2021-02-23 18:10:50","_id":"4e2f61aa15a2909647fa535641f0b394","_score":18.23296},{"summary":"Dash's aqua appliances rival Smeg's retro look, but are way cheaperSave up to 25%: Select Dash countertop appliances are on sale at Amazon. As of Feb. 24, save up to $20 on an aqua-colored toaster, bread maker, and blender.We're officially in the \"retro kitchen obsession\" phase of the pandemic.Leaving KitchenAid's poor pastel pickings in the dust, Twitter has fallen in love with Smeg's pink countertop appliances that look like they traveled straight from the first episode of WandaVision. Naturally, though, people are having a hard time justifying spending $169.","country":"US","clean_url":"mashable.com","author":"AOL Staff","rights":"mashable.com","link":"https://mashable.com/shopping/feb-24-dash-kitchen-appliances/","rank":"151","topic":"news","language":"en","title":"Dash's aqua appliances rival Smeg's retro look, but are way cheaper","published_date":"2021-02-24 16:20:09","_id":"b04c2bcb5bdcac23036998c863e79350","_score":18.212187},{"summary":"These gorgeous species will help to filter out toxic chemicalsThe change in law will now see abusers face jail timeThe show promises to be just like the Australian oneThe red carpet may have been virtual but the A-list still brought the glam at the 2021 Golden Globes.That eyeliner is not here to make friendsWhere specifically in the queue will you be?Fans of AC-12 rejoice, we now know when the BB drama will returnFrom Red OnlineEnter our competition to win a full hair, skin and make-up edit, worth over £510The actress won the award for best actress in a TV drama for her part in The Crown.","country":"US","clean_url":"yahoo.com","author":null,"rights":"yahoo.com","link":"https://uk.style.yahoo.com/celeb-bumps-kate-lawler-becomes-050300353.html","rank":"29","topic":"science","language":"en","title":"Celeb Bumps: Kate Lawler becomes a mum on MTV","published_date":"2021-03-01 05:03:00","_id":"ae01063f989dbb267a864d53698ba8ba","_score":17.3418},{"summary":"The United Nations' cultural agency may consider the making of French bread, known as the baguette, for its list of 'intangible treasures.' Bakers in France asked the French government to propose the traditional bread for the honor from UNESCO. About 6 million baguettes are sold every day in France. The French minister of culture will make a recommendation to UNESCO in March. The baguette is competing against two other candidates for France's nomination. The candidates are the metal rooftops of buildings in Paris, made from zinc, and a wine festival in the country's Jura area.","country":"NA","clean_url":"voanews.com","author":null,"rights":"2021 - VOA","link":"https://learningenglish.voanews.com/a/french-bread-makers-seek-un-recognition-of-the-baguette/5785457.html","rank":"825","topic":"NA","language":"en","title":"French Bread Makers Seek UN Recognition of the Baguette","published_date":"2021-02-26 21:59:01","_id":"4d5ba2f266933a6e054f264167ac83be","_score":17.000687},{"summary":"Limestone County Council on Aging256-233-6412Nutrition Coordinator Tracy Wooldridge, 256-216-3909 Centers are currently closed.MenusMonday: Sloppy Joe with bun, sweet potatoes, cabbage, pineapple, chocolate chip cookie and milk;Tuesday: Grape juice, barbecue chicken drum (1), mashed potatoes, broccoli with cheese sauce, wheat bread, margarine, chocolate cake and milk;Wednesday: Broiled beef patty with bun, mayonnaise, mustard, ketchup, baked beans, potato salad, shredded lettuce, onion, tomato, fruit cobbler, milk or chocolate milk; Thursday: Grape juice, Hoppin' John, okra and tomatoes, turnip greens, cornbread, margarine, butterscotch pudding, and milk or buttermilk; andFriday: Blended juice, spaghetti with meat sauce, Italian flat beans, mixed green salad, Italian or ranch dressing, wheat bread, margarine, strawberry fruit gelatin, and milk.","country":"US","clean_url":"enewscourier.com","author":null,"rights":"enewscourier.com","link":"https://www.enewscourier.com/news/lifestyles/senior-announcements-for-the-week-of-march-1-5/article_41e68656-7994-11eb-92b3-e701e6ed2319.html","rank":"106613","topic":"news","language":"en","title":"Senior announcements for the week of March 1-5","published_date":"2021-02-28 15:00:00","_id":"4742852cf8158f7a96513f590542822b","_score":16.704287}],"user_input":{"q":"Mohammed’s Flat Bread","search_in":"title_summary","lang":null,"country":null,"from":"2021-02-23 00:00:00","to":null,"ranked_only":"True","from_rank":null,"to_rank":null,"sort_by":"relevancy","page":1,"size":5,"sources":null,"not_sources":null,"topic":null,"media":"False"}}
