{"status":"ok","total_hits":10000,"page":1,"total_pages":2000,"page_size":5,"articles":[{"summary":"Somdatta Saha  |  Updated: February 26, 2021 10:05 ISTIt won't be an exaggeration to say that street foods play a significant role in defining the food culture of India. If you explore, there's no dearth of street foods across the country. They are spicy, flavourful and extensive to the core. In fact, every region has a wide range of unique street-style dishes to offer. From chaats to rolls and kebab - there's no end to the long list of these yummy delights. One such lip-smacking food item is dabeli.","country":"IN","clean_url":"ndtv.com","author":null,"rights":"ndtv.com","link":"https://food.ndtv.com/how-to/watch-how-to-make-kutchi-dabeli-popular-street-food-of-gujarat-and-mumbai-from-the-scratch-recipe-video-2378966","rank":"900","topic":"food","language":"en","title":"Watch: How To Make Kutchi Dabeli","published_date":"2021-02-26 04:32:18","_id":"c07603007b59ac25b56ebff9cf56757c","_score":24.668617},{"summary":"Aanchal Mathur  |  Updated: March 02, 2021 17:53 ISTCucumber, tamarind, onion, or even fruits, one can make chutneys out of so much.One of the most popular things Indian cuisine is famous for is the chutneys. Don't you think? The rest of the world may have their own salsas or dips, Indian chutneys still rule our palates. Be it for the lip-smacking spices or the sheer versatility of them spreading over everything - from sandwiches to parathas - we are never getting over having chutneys as a staple accompaniment with all our meals! And we aren't stuck to just mint or coriander chutney.","country":"IN","clean_url":"ndtv.com","author":null,"rights":"ndtv.com","link":"https://food.ndtv.com/food-drinks/5-south-indian-chutney-recipes-you-must-try-2382057","rank":"899","topic":"food","language":"en","title":"5 South Indian Chutney Recipes You Must Try","published_date":"2021-03-02 12:05:11","_id":"1c27d84d18a8450499017f6da3fa28ca","_score":23.542746},{"summary":"Chutney de Manga com Caju Ana Maria ensina uma receita fácil de Chutney de Manga. O molho indiano é feito de um jeito diferente porque leva uma fruta brasileira nos ingredientes: o caju. Aprenda o passo a passo do molho. Ingredientes - Chutney de Manga com Caju 4 cajus bem maduros descascados 1 xícara de chá de mangas em cubos pequenos 2 colheres de chá de gengibre picado 2 colheres de sopa de açúcar 1 colher de chá de sal 1 colher de chá de cúrcuma Meia xícara de chá de cachaça 2 pimentas dedo-de-moça sem sementes picadinhas 1 colher de chá de amido de milho Um quarto de xícara de chá de vinagre de maçã Coentro picado a gosto Modo de Preparo - Chutney de Manga com Caju 1.","country":"BR","clean_url":"globo.com","author":null,"rights":"globo.com","link":"https://receitas.globo.com/chutney-de-manga-com-caju.ghtml","rank":"796","topic":"news","language":"pt","title":"Chutney de Manga com Caju","published_date":"2021-03-01 13:19:24","_id":"548cdca7d1cb31ea97f3544b58abc75a","_score":21.047506},{"summary":"4 vegan, vegetarian, contains-white-meat, tree-nut-free, gluten-free, red-meat-free, shellfish-free, dairy-free vegetable oil Tesco Plant Chef Meat-Free Cumberland-style Banger onion garlic cloves ½ tsp ground cumin ½ tsp ground coriander g tin chopped tomatoes g tin haricot beans ½ vegetable stock pot mango chutney g frozen butternut squash g spinach g fresh parsley [ { \" and at;type\": \"HowToStep\", \"text\": \"Heat the oil in a large, shallow casserole dish set over a medium heat. Add the bangers and cook for 3-5 mins until lightly browned all over.","country":"NA","clean_url":"bigoven.com","author":null,"rights":"bigoven.com","link":"https://www.bigoven.com/recipe/carls-all-change-casserole/2471038","rank":"26947","topic":"NA","language":"en","title":"Carl's 'all-change casserole'","published_date":"2021-02-24 19:45:27","_id":"3dd736dcfd4e515eb904048a2096e8c9","_score":20.35423},{"summary":"Neha Grover  |  Updated: February 25, 2021 18:38 ISTMake soft idli without stand.South Indian idli makes for an excellent snack or small meal. Making idli is quite easy but sambhar may take time. So if you want to make a quick idli meal, try this idli and peanut chutney combo. This recipe will teach you how to make soft and spongy idli without needing idli maker or special idli stand, and a tasty chutney made with peanuts to go with it. The peanut chutney can be further garnished with a tempering of curry leaves and mustard seeds.","country":"IN","clean_url":"ndtv.com","author":null,"rights":"ndtv.com","link":"https://food.ndtv.com/food-drinks/indian-cooking-tips-how-to-make-idli-without-idli-maker-and-peanut-chutney-watch-recipe-video-2378603","rank":"900","topic":"food","language":"en","title":"Indian Cooking Tips: How To Make Idli Without Idli Maker and Peanut Chutney (Watch Recipe Video)","published_date":"2021-02-25 13:07:30","_id":"638782fce26a3a422ad8c2b86ef7c972","_score":20.130451}],"user_input":{"q":"Red Chutney","search_in":"title_summary","lang":null,"country":null,"from":"2021-02-23 00:00:00","to":null,"ranked_only":"True","from_rank":null,"to_rank":null,"sort_by":"relevancy","page":1,"size":5,"sources":null,"not_sources":null,"topic":null,"media":"False"}}
