{"status":"ok","total_hits":10000,"page":1,"total_pages":2000,"page_size":5,"articles":[{"summary":"I cooked this for 45 minutes and it's the perfect balance between cooking the grains and not overcooking the fish. I suggest trying this with your slow cooker and adapting the cooking time accordingly. When I tried for pinker fish, the rice still had too much bite, as did the onion, so for me, 45 minutes kept everything in balance. It's the ultimate shove-in-and-forget dish while you find the wine and the remote. Prep time: 5 minutes | Cooking time: 50 minutes SERVES  Two to three INGREDIENTS 1 tbsp olive oil 1 onion, finely chopped 1 tbsp coriander seeds, roughly ground 1 tsp toasted cumin seeds, roughly ground 2 tsp rose harissa, or to taste 100g basmati rice 95g couscous 435ml vegetable stock 400g skinless salmon fillets To serve Coriander leaves, roughly chopped METHOD Set the slow cooker to the sauté function.","country":"GB","clean_url":"telegraph.co.uk","author":"Katrina Meynink","rights":"telegraph.co.uk","link":"https://www.telegraph.co.uk/recipes/0/slow-cooker-harissa-salmon-biryani-recipe/","rank":"118","topic":"news","language":"en","title":"Slow cooker harissa salmon biryani recipe","published_date":"2021-02-27 06:00:00","_id":"217b6ad0795d2491c8a974d422c9b8da","_score":28.843555},{"summary":"Having a cookery school has taught me that most people want simple, tasty food that doesn't take hours to make. That's what I concentrate on: simple techniques that even the most novice cook can master. The most important thing is not to be afraid. Turn down the heat and keep calm.  There are things you can always do to improve your cooking. If something tastes tart, you can counter it with honey, apple or redcurrant jelly, maple or golden syrup instead of sugar. They add depth of flavour as well as sweetness.","country":"IE","clean_url":"irishtimes.com","author":null,"rights":"irishtimes.com","link":"https://www.irishtimes.com/life-and-style/food-and-drink/paul-flynn-three-satisfyingly-simple-dishes-that-anyone-can-cook-1.4486311","rank":"873","topic":"food","language":"en","title":"Paul Flynn: Three satisfyingly simple dishes that anyone can cook","published_date":"2021-02-27 06:00:00","_id":"898a06b5b51af08f0220f05253762e36","_score":25.753187},{"summary":"Ready, set, recipes! Here are our just published, fresh-out-the-mill recipes in one convenient place! These are the top vegan recipes of the day, and are now a part of the thousands of recipes on our Food Monster App! Our newest recipes include braised harissa eggplant and overnight oats so if you're looking for something new and delicious, these recipes are it! We also highly recommend downloading the Food Monster App  — with over 15,000 delicious recipes it is the largest meatless, vegan, plant-based and allergy-friendly recipe resource to help you get healthy! And, don't forget to check out our Popular Trends Archives! 1.","country":"NA","clean_url":"onegreenplanet.org","author":"Julia Sloan","rights":"onegreenplanet.org","link":"https://www.onegreenplanet.org/vegan-food/from-braised-harissa-eggplant-and-greens-to-mango-coconut-overnight-oats-top-daily-recipes-march-2021/","rank":"6027","topic":"NA","language":"en","title":"From Braised Harissa Eggplant and Greens to Mango-Coconut Overnight Oats: Our Top Eight Vegan Recipes of the Day!","published_date":"2021-03-01 14:00:33","_id":"5abf329e0e2140c44a11bd531d94e167","_score":25.556124},{"summary":"Feb. 25, 2021, 1:04 PM UTC / Source: TODAYBy Melissa ClarkIt's no mystery why one-pot meals are so popular: Making everything with just one piece of cooking equipment cuts down on cleanup time, keeps prep and cooking quick and makes eating healthy easier. The New York Times' food columnist Melissa Clark is joining TODAY to share a few of her favorite sheet-pan dinner recipes. She shows us how to make roasted cumin-spiced pork chops with Brussels sprouts, chicken and potatoes with garlic yogurt and chicken with sweet tomatoes and pancetta.","country":"US","clean_url":"today.com","author":"Melissa Clark","rights":"today.com","link":"https://www.today.com/food/3-easy-speedy-sheet-pan-dinners-weeknights-t209910","rank":"630","topic":"food","language":"en","title":"3 speedy sheet-pan suppers that will be your weeknight superheroes","published_date":"2021-02-25 13:04:42","_id":"33d5bd7e759a4f4030f8f0df956345f8","_score":24.496552},{"summary":"Why don't you want to hear her story??Photo: Halfpoint (Shutterstock)Yesterday evening, I noticed several of my fellow food writers tweeting about Recipeasly, a website that briefly promised to 'fix' online recipes by stripping them of cultural context, narrative, or any information that isn't an ingredients list and/or instructions. In the promotional tweet sent into the world by Tod Redman (which is what everyone was dunking on), he used a photo of a cherry pie recipe from Serious Eats as an example of a recipe that be deserving of such a violation.","country":"US","clean_url":"lifehacker.com","author":null,"rights":"lifehacker.com","link":"https://skillet.lifehacker.com/dont-just-skip-to-the-recipe-1846379903","rank":"537","topic":"news","language":"en","title":"Don't Just Skip to the Recipe","published_date":"2021-03-01 18:00:00","_id":"9eeec54cfacc854c6cbf6f37ddf99a5b","_score":19.87651}],"user_input":{"q":"Serious Heat: Homemade Harissa Recipe","search_in":"title_summary","lang":null,"country":null,"from":"2021-02-23 00:00:00","to":null,"ranked_only":"True","from_rank":null,"to_rank":null,"sort_by":"relevancy","page":1,"size":5,"sources":null,"not_sources":null,"topic":null,"media":"False"}}
