{
    "Afghanistan": {
        "recipe": "Red Chutney",
        "summary": "Aanchal Mathur  |  Updated: March 02, 2021 17:53 ISTCucumber, tamarind, onion, or even fruits, one can make chutneys out of so much.One of the most popular things Indian cuisine is famous for is the chutneys. Don't you think? The rest of the world may have their own salsas or dips, Indian chutneys still rule our palates. Be it for the lip-smacking spices or the sheer versatility of them spreading over everything - from sandwiches to parathas - we are never getting over having chutneys as a staple accompaniment with all our meals! And we aren't stuck to just mint or coriander chutney.",
        "country": "IN",
        "clean_url": "ndtv.com",
        "author": null,
        "rights": "ndtv.com",
        "link": "https://food.ndtv.com/food-drinks/5-south-indian-chutney-recipes-you-must-try-2382057",
        "rank": "899",
        "topic": "food",
        "language": "en",
        "title": "5 South Indian Chutney Recipes You Must Try",
        "published_date": "2021-03-02 12:05:11",
        "_id": "1c27d84d18a8450499017f6da3fa28ca",
        "_score": 23.542746
    },

    "Albania": {
        "recipe": "papare",
        "summary": "Jayapura (ANTARA) - Jajaran Pangkalan TNI AU (Lanud) Silas Papare Jayapura, Papua, menciptakan sebuah lagu yang dipersembahkan untuk pemuda adat Papua. Komandan Lanud (Danlanud) Silas Papare Marsma TNI Budhi Achmadi di Jayapura, Senin, mengatakan lagu berjudul \"Mars Pemuda Adat Papua\" diciptakan dengan dibantu Galih Setiawan, Wendy Dwi Aditya dalam proses aransemennya yang digarap di Studio Starlight Jakarta, sementara untuk proses edit video dilaksanakan oleh Staf Penerangan Lanud Silas Papare Jayapura.",
        "country": "ID",
        "clean_url": "antaranews.com",
        "author": "Hendrina Dian Kandipi",
        "rights": "antaranews.com",
        "link": "https://papua.antaranews.com/berita/620379/lanud-silas-papare-jayapura-ciptakan-lagu-daerah-mars-pemuda-adat-papua",
        "rank": "12125",
        "topic": "news",
        "language": "id",
        "title": "Lanud Silas Papare Jayapura ciptakan lagu daerah mars pemuda adat Papua",
        "published_date": "2021-03-01 08:06:54",
        "_id": "cd2b0811514b4a7240ed746e458a41a6",
        "_score": 23.488579
    },

    "Algeria": {
            "recipe": "Serious Heat: Homemade Harissa Recipe",
            "summary": "I cooked this for 45 minutes and it's the perfect balance between cooking the grains and not overcooking the fish. I suggest trying this with your slow cooker and adapting the cooking time accordingly. When I tried for pinker fish, the rice still had too much bite, as did the onion, so for me, 45 minutes kept everything in balance. It's the ultimate shove-in-and-forget dish while you find the wine and the remote. Prep time: 5 minutes | Cooking time: 50 minutes SERVES  Two to three INGREDIENTS 1 tbsp olive oil 1 onion, finely chopped 1 tbsp coriander seeds, roughly ground 1 tsp toasted cumin seeds, roughly ground 2 tsp rose harissa, or to taste 100g basmati rice 95g couscous 435ml vegetable stock 400g skinless salmon fillets To serve Coriander leaves, roughly chopped METHOD Set the slow cooker to the sauté function.",
            "country": "GB",
            "clean_url": "telegraph.co.uk",
            "author": "Katrina Meynink",
            "rights": "telegraph.co.uk",
            "link": "https://www.telegraph.co.uk/recipes/0/slow-cooker-harissa-salmon-biryani-recipe/",
            "rank": "118",
            "topic": "news",
            "language": "en",
            "title": "Slow cooker harissa salmon biryani recipe",
            "published_date": "2021-02-27 06:00:00",
            "_id": "217b6ad0795d2491c8a974d422c9b8da",
            "_score": 28.843555
    }
}