{"status":"ok","total_hits":10000,"page":1,"total_pages":2000,"page_size":5,"articles":[{"summary":"Posting to his Instagram stories, Sam Heughan, wrote on a shot of the dinner that the Home by Nico meal was 'so good' before the funny video. In it the star who dressed in a white t shirt and black jacket is sitting enjoying the meal with a glass of wine, says: 'Six by Nico, romantic dinner for two and I'm glad it's with you.' To which the camera cuts to Sam across the table, dressed in a black top and leather jacket and eating one of the dishes. He replies: 'Oh yeah…cheers.' Home by Nico, from the team behind Six by Nico, launched as a response to the lockdown in April 2020.","country":"GB","clean_url":"scotsman.com","author":"Rosalind Erskine","rights":"scotsman.com","link":"https://foodanddrink.scotsman.com/food/outlander-star-sam-heughan-enjoys-so-good-home-by-nico-romantic-meal-for-two-in-funny-video/","rank":"1643","topic":"food","language":"en","title":"Outlander star Sam Heughan enjoys ‘so good' Home by Nico romantic meal for two in funny video","published_date":"2021-02-27 10:04:04","_id":"e3c328c24fb41a2c7011513bdfd89844","_score":17.58183},{"summary":"St. Paul's holds open houseMUNSTER —St. Paul's Lutheran School, 8601 Harrison Ave., Munster, hosts an open house from 1-3 p.m. March 14.St. Paul's is a state and national certified school providing education for children from preschool through 8th grade. This is an opportunity to tour the school, speak with teachers, and learn what St. Paul's has to offer.For more information, please visit www.stplmunster.com or call (219) 836-6270.Fish/chicken fry benefits Wheeler High SoftballVALPARAISO — Wheeler High School Softball serves its second fish and chicken fry of the season from 3:30-7 p.","country":"US","clean_url":"nwitimes.com","author":null,"rights":"nwitimes.com","link":"https://www.nwitimes.com/news/local/lake/calendar-of-events/article_ae068adf-c728-5c3c-aa59-2d058028f833.html","rank":"5687","topic":"news","language":"en","title":"Calendar of events","published_date":"2021-02-26 16:45:00","_id":"16d48d77da61e97418358fc4c920d830","_score":16.721216},{"summary":"GET BREAKING NEWS IN YOUR BROWSER. CLICK HERE TO TURN ON NOTIFICATIONS. Canadian punk rock group Belvedere has just released a new single, 'Good Grief Retreat.' 'Good Grief Retreat' marks the band's first new music since celebrating its 25-year anniversary as a band in 2020. Belvedere's deep connection with fans combined with a strong work ethic has provided them with the opportunity to tour in over 35 countries, playing over 1,500 shows and a number of festivals along the way. Always the first to get into the crowd after a show, most of Belvedere's fans have likely purchased an album directly from the band while many have provided the band a place to stay or meal to eat.","country":"US","clean_url":"times-standard.com","author":"The Times-Standard","rights":"times-standard.com","link":"https://www.times-standard.com/2021/02/25/punk-rock-group-heads-for-good-grief-retreat","rank":"22815","topic":"news","language":"en","title":"Punk rock group heads for ‘Good Grief Retreat'","published_date":"2021-02-25 11:22:33","_id":"a2752472d1f006e983d48ad423854aa9","_score":16.426146},{"summary":"The practice of 'rounding' time punches—adjusting the hours that an employee has actually worked to the nearest preset time increment—is generally lawful where it does not result in, over time, undercompensating employees for all the time they actually worked.  Such rounding practices have survived numerous legal challenges regarding an employer's obligation to maintain accurate time records and compensate employees for total hours worked.  But no case had answered the question of whether a rounding practice is lawful in the context of meal periods.","country":"NA","clean_url":"natlawreview.com","author":"Foley & Lardner LLP","rights":"natlawreview.com","link":"https://www.natlawreview.com/article/punching-next-round-meal-period-class-actions-california-california-supreme-court","rank":"4035","topic":"NA","language":"en","title":"Punching in for the Next Round of Meal Period Class Actions in California: California Supreme Court Strikes Down Use of Rounding Time Punches for Meal Periods","published_date":"2021-03-02 00:41:36","_id":"f7d4d613ebf5ea3e82ffa56f056684e7","_score":16.097126},{"summary":"VACAVILLE — The Vacaville Museum Guild Dinner for 8 or Tea for 12 fundraiser is back, and this time with a Nut Tree twist to celebrate the Museum's Nut Tree Centennial Exhibit in 2021. Both events will be prepared and served by guild members. Dinner for 8 will be held at the former home of Vacaville treasure Don Birrell (1922-2006), who was the director of the Crocker Art Museum in Sacramento from 1951-1953, and the design director of the Nut Tree from 1953 until his retirement in 1990. He also designed the Vacaville city logo, among other iconic images in Solano County.","country":"US","clean_url":"dailyrepublic.com","author":"Daily Republic Staff","rights":"dailyrepublic.com","link":"https://www.dailyrepublic.com/all-dr-news/solano-news/vacaville/museum-guild-schedules-dinner-for-8-tea-for-12-fundraiser/","rank":"32610","topic":"NA","language":"en","title":"Museum Guild schedules dinner for 8, tea for 12 fundraiser","published_date":"2021-02-24 13:55:00","_id":"a83877f64b617e306b0dc7f97fecf8ae","_score":16.085701}],"user_input":{"q":"Tour of Europe: Albania's meal","search_in":"title_summary","lang":null,"country":null,"from":"2021-02-23 00:00:00","to":null,"ranked_only":"True","from_rank":null,"to_rank":null,"sort_by":"relevancy","page":1,"size":5,"sources":null,"not_sources":null,"topic":null,"media":"False"}}
